000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ARITHGRP.
000300* Nucleus level 2 arithmetic: exponentiation, ON SIZE ERROR on
000400* every statement, a series of results, DIVIDE INTO without
000500* GIVING, and DIVIDE ... REMAINDER.
000600 DATA DIVISION.
000700 WORKING-STORAGE SECTION.
000800 01  A            PIC 9(5)  VALUE 10.
000900 01  B            PIC 9(5)  VALUE 20.
001000 01  C            PIC 9(5)  VALUE 0.
001100 01  D            PIC 9(5)  VALUE 0.
001200 01  S2           PIC 99    VALUE 5.
001300 01  T2           PIC 99    VALUE 6.
001400 01  C3           PIC 99    COMP-3 VALUE 5.
001450 01  C3-SHOW      PIC 99.
001500 01  N            PIC 9     VALUE 3.
001600 01  P            PIC 9(9)  VALUE 0.
001700 01  Q            PIC 9(3)V99 VALUE 0.
001800 01  R            PIC 9(3)V99 VALUE 0.
001900 01  E-Q          PIC ZZ9.99.
002000 01  E-R          PIC ZZ9.99.
002100 01  ZED          PIC 9     VALUE 0.
002200 PROCEDURE DIVISION.
002300 MAIN.
002400     COMPUTE C D = A + B.
002500     DISPLAY 'SERIES ' C ' ' D.
002600     ADD 1 TO A B.
002700     DISPLAY 'ADD TO ' A ' ' B.
002800     SUBTRACT 1 FROM A B.
002900     DISPLAY 'SUB FROM ' A ' ' B.
003000     MULTIPLY 3 BY A B.
003100     DISPLAY 'MUL BY ' A ' ' B.
003200     DIVIDE 3 INTO A B.
003300     DISPLAY 'DIV INTO ' A ' ' B.
003400     ADD A B GIVING C D.
003500     DISPLAY 'GIVING ' C ' ' D.
003600     DIVIDE 17 BY 5 GIVING C REMAINDER D.
003700     DISPLAY 'REM ' C ' ' D.
003800     DIVIDE 5 INTO 17 GIVING C REMAINDER D.
003900     DISPLAY 'REM ' C ' ' D.
004000     DIVIDE 10 BY 3 GIVING Q REMAINDER R.
004100     MOVE Q TO E-Q. MOVE R TO E-R.
004200     DISPLAY 'REM ' E-Q ' ' E-R.
004300     DIVIDE 10 BY 3 GIVING Q ROUNDED REMAINDER R.
004400     MOVE Q TO E-Q. MOVE R TO E-R.
004500     DISPLAY 'REM ROUNDED ' E-Q ' ' E-R.
004600     COMPUTE P = 2 ** 10.
004700     DISPLAY 'POW ' P.
004800     COMPUTE Q = 1.5 ** 2.
004900     MOVE Q TO E-Q.
005000     DISPLAY 'POW ' E-Q.
005100     COMPUTE P = B ** N.
005200     DISPLAY 'POW ' P.
005300     COMPUTE P = 7 ** 0.
005400     DISPLAY 'POW ' P.
005500     COMPUTE P = 2 ** 3 ** 2.
005600     DISPLAY 'POW ' P.
005700     ADD 999 TO S2 ON SIZE ERROR DISPLAY 'SIZE 1 ' S2.
005800     ADD 1 TO S2 ON SIZE ERROR DISPLAY 'SIZE 2 WRONG'.
005900     DISPLAY 'AFTER ' S2.
006000     MULTIPLY 20 BY S2 T2 ON SIZE ERROR
006100         DISPLAY 'SIZE 3 ' S2 ' ' T2.
006200     COMPUTE C = A / ZED ON SIZE ERROR DISPLAY 'SIZE 4 ' C.
006300     DIVIDE ZED INTO C ON SIZE ERROR DISPLAY 'SIZE 5 ' C.
006400     COMPUTE S2 ROUNDED = 99.6 ON SIZE ERROR DISPLAY 'SIZE 6 ' S2.
006500     SUBTRACT 100 FROM S2 ON SIZE ERROR DISPLAY 'SIZE 7 ' S2.
006600     ADD 999 TO C3.
006700     MOVE C3 TO C3-SHOW. DISPLAY 'TRUNC ' C3-SHOW.
006800     STOP RUN.
