000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BADSEGL.
000250* SEGMENT-LIMIT outside 1 to 49: refused, as IKFCBL00 refuses it.
001000 ENVIRONMENT DIVISION.
001100 CONFIGURATION SECTION.
001200 SOURCE-COMPUTER. IBM-370.
001300 OBJECT-COMPUTER. IBM-370
001400     SEGMENT-LIMIT IS 50.
001500 DATA DIVISION.
001600 WORKING-STORAGE SECTION.
001700 01  N PIC 9 VALUE 0.
001800 PROCEDURE DIVISION.
001900 MAIN-LINE SECTION.
002000 M1.
002100     PERFORM S10 2 TIMES.
002200     PERFORM S30 2 TIMES.
002300     PERFORM S60 2 TIMES.
002400     PERFORM S30.
002500     PERFORM S60.
002600     DISPLAY 'END'.
002700     STOP RUN.
002800 S10 SECTION 10.
002900 P10.
003000     GO TO P10-A.
003100 P10-A.
003200     DISPLAY 'S10 FIRST'.
003300     ALTER P10 TO PROCEED TO P10-B.
003400     GO TO P10-X.
003500 P10-B.
003600     DISPLAY 'S10 AGAIN'.
003700 P10-X.
003800     EXIT.
003900 S30 SECTION 30.
004000 P30.
004100     GO TO P30-A.
004200 P30-A.
004300     DISPLAY 'S30 FIRST'.
004400     ALTER P30 TO PROCEED TO P30-B.
004500     GO TO P30-X.
004600 P30-B.
004700     DISPLAY 'S30 AGAIN'.
004800 P30-X.
004900     EXIT.
005000 S60 SECTION 60.
005100 P60.
005200     GO TO P60-A.
005300 P60-A.
005400     DISPLAY 'S60 FIRST'.
005500     ALTER P60 TO PROCEED TO P60-B.
005600     GO TO P60-X.
005700 P60-B.
005800     DISPLAY 'S60 AGAIN'.
005900 P60-X.
006000     EXIT.
