000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BADX.
000300* ON takes integer literals; IKFCBL00 refuses an identifier (IKF4064I-E).
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01  X PIC X(4) VALUE 'ABCD'.
000700 01  K PIC 9 VALUE 2.
000800 PROCEDURE DIVISION.
000900 A.
001000     ON K DISPLAY X.
001100     STOP RUN.
