000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BADALTER.
000300 PROCEDURE DIVISION.
000400 P1.
000500     ALTER P2 TO PROCEED TO P3.
000600     STOP RUN.
