000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BADDUP.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  WS-A PIC 9(4) VALUE 1.
000600 01  WS-A PIC 9(4) VALUE 2.
000700 PROCEDURE DIVISION.
000800     STOP RUN.
