000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BADVSPC.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  N PIC 9(5) VALUE SPACES.
000600 PROCEDURE DIVISION.
000700     STOP RUN.
