000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. AMB.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  G1.
000600     05  DUPNAME PIC X(2) VALUE 'AA'.
000700 01  G2.
000800     05  DUPNAME PIC X(2) VALUE 'BB'.
000900 01  T PIC X(2) VALUE SPACES.
001000 PROCEDURE DIVISION.
001100 MAIN-PARA.
001200     MOVE DUPNAME TO T.
001300     STOP RUN.
