000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BADUNDCL.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  WS-A PIC 9(4) VALUE 1.
000600 PROCEDURE DIVISION.
000700     MOVE WS-A TO WS-NOSUCH.
000800     STOP RUN.
