000100* MERGE has no INPUT PROCEDURE: refused.
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. BADMRG.
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT IN1-FILE ASSIGN TO UT-S-INFILE1.
000800     SELECT IN2-FILE ASSIGN TO UT-S-INFILE2.
000900     SELECT OUT-FILE ASSIGN TO UT-S-OUTFILE.
001000     SELECT MERGE-FILE ASSIGN TO UT-S-SORTWK01.
001100 DATA DIVISION.
001200 FILE SECTION.
001300 FD  IN1-FILE LABEL RECORDS ARE STANDARD.
001400 01  IN1-REC PIC X(80).
001500 FD  IN2-FILE LABEL RECORDS ARE STANDARD.
001600 01  IN2-REC PIC X(80).
001700 FD  OUT-FILE LABEL RECORDS ARE STANDARD.
001800 01  OUT-REC PIC X(80).
001900 SD  MERGE-FILE.
002000 01  M-REC.
002100     05  M-NAME   PIC X(10).
002200     05  M-DEPT   PIC 99.
002300     05  M-REST   PIC X(68).
002400 WORKING-STORAGE SECTION.
002500 01  EOF PIC X VALUE 'N'.
002600 PROCEDURE DIVISION.
002700 MAIN-PARA.
002800     MERGE MERGE-FILE ASCENDING KEY M-NAME
002900         INPUT PROCEDURE IS LOAD-IT GIVING OUT-FILE.
003000     STOP RUN.
003100 LOAD-IT SECTION.
003200 L1.
003300     EXIT.
