000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BADDISP.
000300 PROCEDURE DIVISION.
000400*    DISPLAY of an identifier is not implemented yet.
000500     DISPLAY WS-NAME.
000600     STOP RUN.
