000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BIGWS.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  MSG1     PIC X(5)  VALUE 'ALPHA'.
000600 01  PAD1     PIC X(2100) VALUE SPACES.
000700 01  PAD2     PIC X(2100) VALUE SPACES.
000800 01  MSG2     PIC X(5)  VALUE SPACES.
000900 01  ACC      PIC S9(5) COMP VALUE 42.
001000 01  OUT-NUM  PIC 9(5)  VALUE 0.
001100 PROCEDURE DIVISION.
001200 MAIN-PARA.
001300     MOVE MSG1 TO MSG2.
001400     DISPLAY MSG2.
001500     ADD 100 TO ACC.
001600     MOVE ACC TO OUT-NUM.
001700     DISPLAY OUT-NUM.
001800     STOP RUN.
