000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CALLSUB.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  T OCCURS 3 PIC X(4) VALUE 'ABCD'.
000600 PROCEDURE DIVISION.
000700     CALL 'FOO' USING T(1).
000800     STOP RUN.
