000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CDCOPY.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  SHOW-DATE PIC X(8).
000600 PROCEDURE DIVISION.
000700     COPY CDATE.
000800     DISPLAY SHOW-DATE.
000900     STOP RUN.
