000001*>>SOURCE FORMAT IS FIXED
000002*> COBCALC - Algebraic Expression Evaluator in COBOL
000003*> Copyright (C) 2025 manny juan
000004*>
000005*> This program is free software: you can redistribute it and/or modify
000006*> it under the terms of the GNU General Public License as published by
000007*> the Free Software Foundation, either version 3 of the License, or
000008*> (at your option) any later version.
000009*>
000010*> This program is distributed in the hope that it will be useful,
000011*> but WITHOUT ANY WARRANTY; without even the implied warranty of
000012*> MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
000013*> GNU General Public License for more details.
000014*>
000015*> You should have received a copy of the GNU General Public License
000016*> along with this program.  If not, see <https://www.gnu.org/licenses/>.
000017 IDENTIFICATION DIVISION.
000018 PROGRAM-ID. COBCAL74.
000019*    THIS CODE WAS MEANT TO COMPILE IN COBOL 74.
000020*    (IT SHOULD RUN IN A TK4- ENVIRONMENT)
000021 AUTHOR. MANNY JUAN.
000022 DATE-WRITTEN. 10/17/2025.
000023 ENVIRONMENT DIVISION.
000024 INPUT-OUTPUT SECTION.
000025 FILE-CONTROL.
000026
000027 DATA DIVISION.
000028 WORKING-STORAGE SECTION.
000029
000030 01  INPUT-EXPR          PIC X(80) VALUE SPACES.
000031 01  FILLER REDEFINES INPUT-EXPR.
000032   03  INPUT-EXPR-CH PIC X(01) OCCURS 80 TIMES.
000033 01  CURR-POS            PIC 999 VALUE 1.
000034 01  EXPR-LEN            PIC 999 VALUE 0.
000035
000036 01  VALUE-STACK.
000037     05  VAL-VALUES          COMP-2 OCCURS 50 TIMES.
000038     05  VAL-VALUE-TOP       PIC 99 VALUE 0.
000039
000040 01  VAL-TOP-HISTORY.
000041     05  VAL-TOP-AT-OPEN     OCCURS 50 TIMES PIC 99.
000042 01  OP-STACK.
000043     05  OPS             PIC X OCCURS 50 TIMES.
000044     05  OP-TOP          PIC 99 VALUE 0.
000045
000046        01  TEMP-CHAR           PIC X.
000047 01  TEMP-CHAR-VAL REDEFINES TEMP-CHAR PIC 9.
000048 01  TEMP-NUM            COMP-2  VALUE 0.
000049 01  WHOLE-NUMBER        PIC S9(15) COMP-3 VALUE +1.
000050 01  DENOM               PIC S9(13) COMP-3 VALUE +1.
000051 01  DENOM-MULT          PIC S9(03) COMP-3 VALUE +1.
000052 01  WRK-RESULT PIC Z(9)9.99999-.
000053
000054 01  LEFT-VAL            COMP-2.
000055 01  RIGHT-VAL           COMP-2.
000056 01  RESULT              COMP-2.
000057
000058 01  PREC-CURR           PIC 9 VALUE 0.
000059 01  PREC-TOP            PIC 9 VALUE 0.
000060 01  EARLY-EXIT         PIC 9 VALUE 0.
000061 PROCEDURE DIVISION.
000062 MAIN-LOGIC.
000063     DISPLAY 'ENTER EXPRESSION (OR END): '.
000064     ACCEPT INPUT-EXPR.
000065     PERFORM CALC-REPL UNTIL INPUT-EXPR = 'END'.
000066     STOP RUN.
000067
000068 CALC-REPL.
000069     PERFORM FIND-LEN VARYING EXPR-LEN FROM 80 BY -1
000070     UNTIL EXPR-LEN = 1
000071      OR INPUT-EXPR-CH (EXPR-LEN) NOT = SPACE.
000072     DISPLAY 'EXPR-LEN=' EXPR-LEN.
000073     PERFORM SOLVE-EXPR.
000074     ACCEPT INPUT-EXPR.
000075
000076 FIND-LEN.
000077     EXIT.
000078
000079 SOLVE-EXPR.
000080     DISPLAY 'EXP = ' INPUT-EXPR
000081     PERFORM INIT-STACKS.
000082     PERFORM SCAN-LOOP THRU SCAN-LOOP-EXIT
000083         UNTIL CURR-POS > EXPR-LEN.
000084     PERFORM APPLY-REMAINING-OPS.
000085     MOVE VAL-VALUES (1) TO RESULT.
000086     MOVE RESULT TO WRK-RESULT
000087     DISPLAY 'ANS = ' WRK-RESULT.
000088
000089 INIT-STACKS.
000090     MOVE 0 TO   VAL-VALUE-TOP.
000091     MOVE 0 TO OP-TOP.
000092     MOVE 1 TO CURR-POS.
000093
000094 SCAN-LOOP.
000095     MOVE INPUT-EXPR-CH (CURR-POS) TO TEMP-CHAR.
000096*    DISPLAY '>>> SCANNING POS ' CURR-POS ' CHAR=[' TEMP-CHAR ']'
000097     IF TEMP-CHAR = SPACE
000098         ADD 1 TO CURR-POS
000099         GO TO SCAN-LOOP-EXIT.
000100
000101     IF TEMP-CHAR IS NUMERIC OR TEMP-CHAR = '.'
000102         PERFORM PARSE-NUMBER
000103         GO TO SCAN-LOOP-EXIT.
000104
000105     IF TEMP-CHAR = '('
000106         ADD 1 TO OP-TOP
000107         MOVE '(' TO OPS (OP-TOP)
000108         MOVE VAL-VALUE-TOP TO VAL-TOP-AT-OPEN (OP-TOP)
000109         ADD 1 TO CURR-POS
000110         GO TO SCAN-LOOP-EXIT.
000111
000112     IF TEMP-CHAR = ')'
000113         PERFORM APPLY-UNTIL-OPEN-PAREN
000114         ADD 1 TO CURR-POS
000115         GO TO SCAN-LOOP-EXIT.
000116
000117     IF TEMP-CHAR = '+'
000118*> Unary '+' is ignored; binary '+' handled normally
000119         IF VAL-VALUE-TOP > 0
000120*> This is binary plus
000121             MOVE 1 TO PREC-CURR
000122             PERFORM APPLY-WHILE-HIGHER-OR-EQUAL
000123             ADD 1 TO OP-TOP
000124             MOVE '+' TO OPS (OP-TOP)
000125             ADD 1 TO CURR-POS
000126             GO TO SCAN-LOOP-EXIT
000127         ELSE
000128             ADD 1 TO CURR-POS
000129             GO TO SCAN-LOOP-EXIT.
000130
000131     IF TEMP-CHAR = '-'
000132*> Check for unary minus
000133         IF (VAL-VALUE-TOP = 0 AND OP-TOP = 0)
000134            OR (OP-TOP > 0 AND OPS (OP-TOP) = '('
000135            AND VAL-VALUE-TOP = VAL-TOP-AT-OPEN (OP-TOP))
000136*> Unary minus: push 0 and treat as binary minus
000137             ADD 1 TO VAL-VALUE-TOP
000138             MOVE 0 TO VAL-VALUES (VAL-VALUE-TOP)
000139             MOVE 1 TO PREC-CURR
000140             PERFORM APPLY-WHILE-HIGHER-OR-EQUAL
000141             ADD 1 TO OP-TOP
000142             MOVE '-' TO OPS (OP-TOP)
000143             ADD 1 TO CURR-POS
000144             GO TO SCAN-LOOP-EXIT
000145         ELSE
000146*> Binary minus
000147             MOVE 1 TO PREC-CURR
000148             PERFORM APPLY-WHILE-HIGHER-OR-EQUAL
000149             ADD 1 TO OP-TOP
000150             MOVE '-' TO OPS (OP-TOP)
000151             ADD 1 TO CURR-POS
000152             GO TO SCAN-LOOP-EXIT.
000153
000154     IF TEMP-CHAR = '*' OR TEMP-CHAR = '/'
000155         MOVE 2 TO PREC-CURR
000156         PERFORM APPLY-WHILE-HIGHER-OR-EQUAL
000157         ADD 1 TO OP-TOP
000158         MOVE TEMP-CHAR TO OPS (OP-TOP)
000159         ADD 1 TO CURR-POS
000160         GO TO SCAN-LOOP-EXIT.
000161
000162     IF TEMP-CHAR = '^'
000163         MOVE 3 TO PREC-CURR
000164         PERFORM APPLY-WHILE-HIGHER-OR-EQUAL
000165         ADD 1 TO OP-TOP
000166         MOVE TEMP-CHAR TO OPS (OP-TOP)
000167         ADD 1 TO CURR-POS
000168         GO TO SCAN-LOOP-EXIT.
000169     DISPLAY 'INVALID CHARACTER: ' TEMP-CHAR
000170     STOP RUN.
000171 SCAN-LOOP-EXIT.
000172     EXIT.
000173
000174
000175 PARSE-NUMBER.
000176     MOVE 0 TO TEMP-NUM.
000177     MOVE 0 TO WHOLE-NUMBER
000178     MOVE 1 TO DENOM.
000179     MOVE 1 TO DENOM-MULT.
000180     PERFORM PARSE-NUM-LOOP UNTIL CURR-POS > EXPR-LEN
000181         OR NOT (INPUT-EXPR-CH (CURR-POS) IS NUMERIC
000182                 OR INPUT-EXPR-CH (CURR-POS) = '.').
000183     COMPUTE TEMP-NUM = WHOLE-NUMBER / DENOM.
000184
000185     ADD 1 TO VAL-VALUE-TOP.
000186     MOVE TEMP-NUM TO VAL-VALUES (VAL-VALUE-TOP).
000187*    DISPLAY 'PUSHED: ' TEMP-NUM ' TOP=' VAL-VALUE-TOP.
000188
000189
000190 PARSE-NUM-LOOP.
000191     MOVE INPUT-EXPR-CH (CURR-POS) TO TEMP-CHAR
000192     IF TEMP-CHAR IS NUMERIC
000193         COMPUTE WHOLE-NUMBER = WHOLE-NUMBER * 10 + TEMP-CHAR-VAL
000194         COMPUTE DENOM = DENOM * DENOM-MULT
000195     ELSE
000196         IF TEMP-CHAR = '.'
000197             MOVE 10 TO DENOM-MULT.
000198
000199     ADD 1 TO CURR-POS.
000200
000201 APPLY-UNTIL-OPEN-PAREN.
000202     PERFORM APPLY-TOP-OP UNTIL OP-TOP = 0 OR OPS (OP-TOP) = '('.
000203
000204     IF OP-TOP = 0
000205         DISPLAY 'MISMATCHED PARENTHESES'
000206         STOP RUN.
000207*> Discard '('.
000208     SUBTRACT 1 FROM OP-TOP.
000209
000210 APPLY-WHILE-HIGHER-OR-EQUAL.
000211     PERFORM TEST-AND-APPLY.
000212     MOVE 0 TO EARLY-EXIT
000213     PERFORM CHECK-PREC
000214     UNTIL (OP-TOP = 0 OR OPS (OP-TOP) = '(' OR EARLY-EXIT = 1).
000215
000216 CHECK-PREC.
000217     IF OPS (OP-TOP) = '^'
000218         MOVE 3 TO PREC-TOP
000219     ELSE
000220         IF OPS (OP-TOP) = '*' OR OPS (OP-TOP) = '/'
000221             MOVE 2 TO PREC-TOP
000222         ELSE
000223             MOVE 1 TO PREC-TOP.
000224
000225     IF PREC-TOP NOT < PREC-CURR
000226         PERFORM APPLY-TOP-OP
000227         PERFORM TEST-AND-APPLY
000228     ELSE
000229         MOVE 1 TO EARLY-EXIT.
000230
000231 TEST-AND-APPLY.
000232     EXIT.
000233 APPLY-TOP-OP.
000234*    DISPLAY '>>> APPLY-TOP-OP: VAL-TOP=' VAL-VALUE-TOP
000235*    ' OP-TOP=' OP-TOP ' OP=' OPS (OP-TOP)
000236     IF VAL-VALUE-TOP < 2
000237         DISPLAY 'SYNTAX ERROR: INSUFFICIENT OPERANDS'
000238         STOP RUN.
000239
000240     MOVE    VAL-VALUES (VAL-VALUE-TOP) TO RIGHT-VAL.
000241     SUBTRACT 1 FROM VAL-VALUE-TOP.
000242     MOVE VAL-VALUES (VAL-VALUE-TOP) TO LEFT-VAL.
000243
000244      IF OPS (OP-TOP) = '^'
000245        COMPUTE VAL-VALUES (VAL-VALUE-TOP) = LEFT-VAL ** RIGHT-VAL
000246     ELSE IF OPS (OP-TOP) = '+'
000247        COMPUTE VAL-VALUES (VAL-VALUE-TOP) = LEFT-VAL + RIGHT-VAL
000248     ELSE IF OPS (OP-TOP) = '-'
000249        COMPUTE VAL-VALUES (VAL-VALUE-TOP) = LEFT-VAL - RIGHT-VAL
000250     ELSE IF OPS (OP-TOP) = '*'
000251        COMPUTE VAL-VALUES (VAL-VALUE-TOP) = LEFT-VAL * RIGHT-VAL
000252     ELSE IF OPS (OP-TOP) = '/' AND RIGHT-VAL = 0
000253        DISPLAY 'DIVISION BY ZERO'
000254        STOP RUN
000255     ELSE IF OPS (OP-TOP) = '/' AND RIGHT-VAL NOT = 0
000256        COMPUTE VAL-VALUES (VAL-VALUE-TOP) = LEFT-VAL / RIGHT-VAL.
000257
000258     SUBTRACT 1 FROM OP-TOP.
000259*    DISPLAY 'AFTER DECREMENT: OP-TOP=' OP-TOP.
000260
000261
000262 APPLY-REMAINING-OPS.
000263     PERFORM APPLY-TOP-OP UNTIL OP-TOP = 0.
000264
