000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.           COBXREF.
000300 AUTHOR.               V B COEN, APPLEWOOD COMPUTER SERVICES.
000400 DATE-WRITTEN.         28 JULY 67: 83 & 2015 for later compilers.
000500 DATE-COMPILED.        TODAY.
000600 SECURITY.             COPYRIGHT (C) 1967-To date - V B COEN.
000700*
000800*              Distributed under the GNU General Public License
000900*              v2.0. Only. See the file COPYING for details
001000*
001100*
001200* USAGE.               COBOL CROSS REFERENCER
001300*                      FOR ANSI COBOL CB545 V2 LVL78 ANSI or
001400*                          similar.
001500*
001600*                  PARM cc1 = R = Resequenced deck by 10 or
001700*                             C = Reseq of 100 or
001710*                               space for none)
001800*                       cc2-9 Program name 8 chars so if both
001900*                             code PARM='RCOBXREF' or 'CCOBXREF'.
002000*                             Program Name used in first headings
002100*                              otherwise it will be COBL.
002200*
002300* COBXREF ERROR MESSAGES.
002400*    XREF001; Premature EOF on source input,EOJ!!
002500*  not used for ANSI    XREF002: JCL Error: File not present!
002510*    XREF002: JCL Error: File not present!
002600*    XREF003; No records present, EOJ!!
002620*  to be added -
002630*    XREF005: 'Cannot find Copy Member'
002640*    XREF006: if needed
002650*    XREF007: if needed
002700*
002710* CALLED BY:           None.
002720*
002730* CALLS:               NC93205 (FROM CBT TAPE FILE 152).
002750*                      See included ASM file & associate JCL
002760*                      See readme notes about installation.
002770*
002800* CHANGES.
002900*
003000* 12/02/07 vbc - 4.3 Remove alter verb + cosmetics for OC.
003100* 18/02/14 vbc -     Clearout OC and add in IBM OSVS2 Cobol
003200*                    EG MVT/MVS ANSI COBOL V545 LVL2.
003300*                    THERE IS NO SUPPORT FOR COPY LIBRARIES
003400*                    or BASIS etc AT THIS TIME.
003500* 24/02/14 vbc - .30 Remark out 'pass' and other debug msgs
003600*                    Force new page at start of xref list.
003700* 28/02/14 vbc - .31 Modify parm 1 to R & C where seq no
003800*                    increments are 10 & 100 respectively.
003900* 02/03/14 vbc - .32 Remove some unused ws items found with ...
004000*                    added 'STOP', what happened to that?
004100* 21/03/14 vbc - .33 Added missing ANSI reserved words &
004200*                    and rem'd out 'INSPECT ' (not in ANSI).
004300*                    and delibrately omitted reserved WS names
004400*                    such as TALLY RETURN-CODE etc so that
004500*                    are referenced including numeric literals.
004600*                    Does NOT handle the NOTE verb.
004700*                    Does anyone use it over '*' in cc7 ?
004800* 24/04/14 vbc - .34 Remove page 1 test on headings so only will
004900*                    T-O-P for every head as pointless on MVS etc.
005000* 25/04/14 VBC - .34 BUG FOUND: AFTER A PARA FOLLOWED BY *
005100*                    LINE NUMBERING GET MISSED BY ONE WITH 1 DUPLI
005200* 13/07/14 VBC - .35 HOPEFULLY removed above bug by removing
005300*                    perform inc-cobrefno other than get a record.
005400* 15/07/14 VBC -     THERE IS NO SUPPORT FOR COPY REPLACING AT
005500*                    THIS TIME but has minor coding for such.
005510* 22/07/14 vbc - .36 Added in WS-PDS for initial COPY support
005511*                    more later.
005512* 30/11/15 VBC - .37 Added test for LINE and treat as FILLER.
005514*                    Next to add, is tests for COLUMN and look
005516*                    for SUM or SOURCE then process as fieldname
005518*                    THIS IS ONLY for Report Writer source
005520*                    so I will put it off for the moment.
005600******
005700*
005800* Copyright Notice.
005900******************
006000*
006100* This file/program is part of Cobxref and is
006200*  copyright (c) Vincent Bryan Coen,FMBS (ret) 1967-2015.
006300*
006400* This is a version for running with MVT/MVS 3.8J and ANSI Cobol
006500* only & is available for those users running IBM emulation with
006600* Hercules where the compiler fails when using the XREF parm.
006700*
006800* This program is free software; you can redistribute it and/or
006900* modify it under the terms of the GNU General Public License as
007000* published by the Free Software Foundation; version 2 and is
007100* available FREE OF CHARGE AND WITH FULL SOURCE CODE.
007200*
007300* It cannot be included or used with any other Compiler without
007400* the written Authority by the copyright holder, Vincent B Coen.
007500*
007600* Cobxref is distributed in the hope that it will be useful, but
007700* WITHOUT ANY WARRANTY; without even the implied warranty of
007800* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
007900* GNU General Public License for more details. If it breaks, you
008000* own both pieces but I will endevor to fix it, providing you
008100* tell me about the problem.
008200*
008300* You should have received a copy of the GNU General Public
008400* License along with Cobxref; see the file COPYING.  If not,
008500* write to the Free Software Foundation, 59 Temple Place,
008600* Suite 330, Boston, MA 02111-1307 USA.
008700*****************************************************************
008800*
008900 ENVIRONMENT DIVISION.
009000 CONFIGURATION SECTION.
009100 SOURCE-COMPUTER.      IBM-370.
009200 OBJECT-COMPUTER.      IBM-370.
009300 SPECIAL-NAMES.
009400     C01 IS TO-TOP-OF-PAGE.
009500 INPUT-OUTPUT SECTION.
009600 FILE-CONTROL.
009700*
009800     SELECT COPYLIBRARY-SRC ASSIGN UT-S-COPYBOOK.
009900     SELECT SUPPLEMENTAL-PART2-IN ASSIGN UT-S-SYSPART2.
010000     SELECT SUPPLEMENTAL-PART1-OUT ASSIGN UT-S-SYSPART1.
010100*
010200     SELECT SOURCE-LISTING ASSIGN UR-1403-S-PRINT.
010300     SELECT SOURCEINPUT ASSIGN UR-S-SOURCE.
010400     SELECT REBUILD-SOURCE ASSIGN UR-S-NEWSRC.
010500*
010600     SELECT SORTFILE ASSIGN UR-S-SORTTMP.
010700*
010800 I-O-CONTROL.
010900*
011000     SAME RECORD AREA FOR SUPPLEMENTAL-PART1-OUT
011100                          SUPPLEMENTAL-PART2-IN.
011200/
011300 DATA DIVISION.
011400 FILE SECTION.
011500 FD  SOURCE-LISTING
011600     RECORDING V
011700     LABEL RECORD OMITTED.
011800 01  SOURCE-LIST.
011900     03  FILLER              PIC X.
012000     03  SL-GEN-REFNO1       PIC Z(5)9B.
012100     03  SL-GEN-REFNO2       PIC Z(5)9B.
012200     03  SL-COPYGENX.
012300       05  SL-SQ-L           PIC X.
012400       05  SL-COPY-DEPTH     PIC 99.
012500       05  SL-SQ-R-COL       PIC XX.
012600       05  FILLER            PIC X.
012700     03  SOURCEOUTPUT.
012800       05  COBOLREFNOOUT     PIC 9(6).
012900       05  FILLER            PIC X(74).
013000*
013100 01  PRINTLINE.
013200     03  FILLER              PIC X.
013300     03  XRDATANAME          PIC X(33).
013400     03  XRDEFN              PIC 9(6).
013500     03  XRTYPE              PIC X.
013600     03  FILLER              PIC XX.
013700     03  FILLER     OCCURS 8.
013800       05  XRREFERENCE       PIC 9(6).
013900       05  FILLER            PIC X.
014000     03  FILLER              PIC X(22).
014100*
014200 FD  COPYLIBRARY-SRC
014300     RECORDING MODE F
014400     BLOCK 19040 CHARACTERS
014500     LABEL RECORD OMITTED.
014600 01  COPYBOOK-SRC            PIC X(80).
014700*
014800 FD  SOURCEINPUT
014900     RECORDING MODE F
015000     BLOCK 19040 CHARACTERS
015100     LABEL RECORD OMITTED.
015200*
015300 01  SOURCERECIN             PIC X(80).
015400*
015500 FD  REBUILD-SOURCE
015600     RECORDING F
015700     LABEL RECORD OMITTED.
015800*
015900 01  SOURCERECOUT.
016000     03  SRO-SEQNO           PIC 9(6).
016100     03  FILLER              PIC X(74).
016200*
016300 FD  SUPPLEMENTAL-PART1-OUT
016400     RECORDING F
016500     LABEL RECORD STANDARD.
016600*
016700 01  SORTRECORD.
016800     03  SKADATANAME         PIC X(32).
016900     03  SKAWSORPD           PIC 9.
017000     03  SKAWSORPD2          PIC 9.
017100     03  SKAREFNO            PIC 9(6).
017200*
017300 FD  SUPPLEMENTAL-PART2-IN
017400     RECORDING F
017500     LABEL RECORD STANDARD.
017600*
017700 01  SUPPPT2INREC            PIC X(40).
017800*
017900 SD  SORTFILE.
018000 01  SDRECORD.
018100     03  SDSORTKEY           PIC X(40).
018200/
018300 WORKING-STORAGE SECTION.
018400 77  PROG-NAME               PIC X(13) VALUE 'COBXREF V4.37'.
018500*  v4 is for IBM ansi cobol
018600 77  PRE-SORT-COUNT          PIC S9(6) COMP  VALUE ZERO.
018700 77  WITHINPARENS-COUNT      PIC S99   COMP  VALUE ZERO.
018800 77  STRING-POINTER          PIC S99   COMP  VALUE +1.
018900 77  STRING-POINTER2         PIC S99   COMP  VALUE +1.
019000 77  COBOLREFNO              PIC 9(6)        VALUE ZERO.
019100 77  GEN-REFNO1              PIC 9(6)        VALUE ZERO.
019200 77  GEN-REFNO2              PIC 9(6)        VALUE ZERO.
019300 77  COPY-DEPTH              PIC 99          VALUE ZERO.
019400 77  WBUCKET                 PIC S99   COMP  VALUE ZERO.
019500 77  Q                       PIC S9(5) COMP  VALUE ZERO.
019600 77  COUNTSOURCEGROUP        PIC S99   COMP  VALUE ZERO.
019700 77  COUNTSOURCEDIGIT        PIC S99   COMP  VALUE ZERO.
019800 77  COUNTFOUNDDIGIT         PIC S99   COMP  VALUE ZERO.
019900 77  COUNTFOUNDGROUP         PIC S99   COMP  VALUE ZERO.
020000 77  LCONB                   PIC 99    COMP  VALUE 70.
020100 77  PGNOB                   PIC S9(4) COMP  VALUE ZERO.
020200 77  YES                     PIC X           VALUE 'Y'.
020300 77  NOS                     PIC X           VALUE 'N'.
020400 77  WAS                     PIC X           VALUE 'W'.
020500 77  MAY                     PIC X           VALUE 'M'.
020600 77  GOT                     PIC X           VALUE 'G'.
020700 77  SW-2                    PIC X           VALUE 'N'.
020800     88  PUNCH-SOURCE                        VALUE 'Y'.
020900 77  SW-3                    PIC X           VALUE 'Y'.
021000     88  SOURCE-PRINT                        VALUE 'Y'.
021100 77  SW-4                    PIC X           VALUE 'N'.
021200     88  SEQUENCE-100                        VALUE 'Y'.
021300 77  FLAG-TO-SIGNAL-SUBSCRIPT PIC X          VALUE 'N'.
021400 77  HOLDOVERLAPDIGIT        PIC X           VALUE SPACE.
021500 77  HOLDWSORPD              PIC 9           VALUE 0.
021600 77  HOLDWSORPD2             PIC 9           VALUE 0.
021700 77  HAVEPERIOD              PIC X           VALUE 'N'.
021800 77  DIDHAVEPERIOD           PIC X           VALUE 'N'.
021900 77  WITHINPARENS            PIC X           VALUE 'N'.
022000 77  WITHINQUOTES            PIC X           VALUE 'N'.
022100 77  ISNUMERICLITERAL        PIC X           VALUE 'N'.
022200 77  ISPARSEC                PIC X           VALUE 'N'.
022300 77  IGNORELEADSPACES        PIC X           VALUE 'Y'.
022400 77  THEDIGIT                PIC X           VALUE SPACE.
022500 77  ISSTARTOFPARSEC         PIC X           VALUE SPACES.
022600 77  FINDPERIOD              PIC X           VALUE SPACES.
022700 77  FOUNDPERIOD             PIC X           VALUE SPACES.
022800 77  NUMERIC-PARAGRAPH-SWITCH   PIC X        VALUE 'N'.
022900 77  JUST-READ-A-PARAGRAPH-NAME PIC X        VALUE 'N'.
023000 77  ISFIRSTCARDAPARAGRAPH   PIC X           VALUE 'Y'.
023100 77  HOLDSECNAME             PIC X(32)       VALUE SPACES.
023200 77  SAVESKADATANAME         PIC X(32)       VALUE SPACES.
023300 77  FS-REPLY                PIC XX          VALUE ZEROS.
023400 77  SORT-RETURN-9           PIC 9(5)        VALUE ZERO.
023500*
023600* These switches help to replace alter verb used in this prog
023700*
023800 77  SW-ENDSWITCH            PIC X           VALUE 'G'.
023900 77  SW-ENDBRANCH            PIC X           VALUE 'I'.
024000 77  SW-HAVEPARSEC           PIC X           VALUE '1'.
024100 77  SW-RL3CHECKWORD         PIC X           VALUE '1'.
024200 77  SW-SFDSWITCH            PIC X           VALUE 'T'.
024300 77  SW-YESVERB              PIC X           VALUE 'F'.
024400/
024500 01  HOLDVERB                PIC X(4)        VALUE SPACES.
024600 01  HOLDID.
024700     02  HOLDID1             PIC X(4)        VALUE SPACES.
024800     02  HOLDID2             PIC X(26)       VALUE SPACES.
024900 01  SOURCEINWS              PIC X(80).
025000 01  SOURCEVIEW REDEFINES SOURCEINWS.
025100     02  COBOLSOURCELINE.
025200       03  COBOLSEQNO.
025300         04  COBOLSEQNO-9    PIC 9(6).
025400       03  COBOLCONT         PIC X.
025500       03  COBOLFORMA.
025600         04  COBOL8AND9      PIC XX.
025700         04  COBOL10AND11    PIC XX.
025800       03  COBOLFORMB        PIC X(61).
025900       03  COBOLID           PIC X(8).
026000*
026100 01  SOURCEVIEW1 REDEFINES SOURCEINWS.
026200     02  FILLER              PIC X(7).
026300     02  SV1CHECKS.
026400      03  CHECK1.
026500       04  SV1WHAT.
026600        05  SV1PROGRAM-ID    PIC X(11).
026700        05  FILLER           PIC X.
026800        05  SV1THEID-1       PIC X(4).
026900       04  SV1THEID-2        PIC X(8).
027000       04  FILLER            PIC X(49).
027100*
027200 01  SOURCEVIEW2 REDEFINES SOURCEINWS.
027300     02  FILLER              PIC X(7).
027400     02  SV2GROUP.
027500      03 SV2                 PIC X(8)  OCCURS 8.
027600      03 SV2-65              PIC X.
027700     02  FILLER              PIC X(8).
027800*
027900 01  SOURCEVIEW3 REDEFINES SOURCEINWS.
028000     02  SV3DPROG.
028100      03  SV3-1              PIC X    OCCURS 11.
028200     02  SV3PROGRAMID.
028300      03  SV3-12             PIC X    OCCURS 61.
028400     02  FILLER              PIC X(8).
028500*
028600 01  WS8DIGITS.
028700     02  WS8DIGIT            PIC X    OCCURS 8.
028800*
028900 01  WS8FOUND.
029000     02  WSFOUND             PIC X    OCCURS 8.
029100*
029200 01  WSFOUNDWORD.
029300     04  WSF1-17.
029400      05  WSF1-16.
029500       06  WSF1-15.
029600        07  WSF1-14.
029700         08  WSF1-13.
029800          09  WSF1-12.
029900           10  WSF1-11.
030000            11  WSF1-10.
030100             12  WSF1-9.
030200              13  WSF1-8.
030300               14  WSF1-7.
030400                15  WSF1-6.
030500                 16  WSF1-5.
030600                  17  WSF1-4.
030700                   18  WSF1-3.
030800                    19  WSF1-2.
030900                     20  WSF1-1 PIC X.
031000                     20  FILLER PIC X.
031100                    19  FILLER  PIC X.
031200                   18  FILLER   PIC X.
031300                  17  FILLER    PIC X.
031400                 16  FILLER     PIC X.
031500                15  FILLER      PIC X.
031600               14  FILLER       PIC X.
031700              13  FILLER        PIC X.
031800             12  FILLER         PIC X.
031900            11  FILLER          PIC X.
032000           10  FILLER           PIC X.
032100          09  FILLER            PIC X.
032200         08  FILLER             PIC X.
032300        07  FILLER              PIC X.
032400       06  FILLER               PIC X.
032500      05  FILLER                PIC X.
032600     04  FILLER                 PIC X(15).
032700*
032800 01  WSFOUNDWORD1 REDEFINES WSFOUNDWORD.
032900     02  WSFOUND8-1-2           PIC XX.
033000     02  WSFOUND8-1-3           PIC X.
033100     02  WSFOUND8-1-4           PIC X.
033200     02  WSFOUND8-1-5           PIC X.
033300     02  WSFOUND8-1-6           PIC X.
033400     02  WSFOUND8-1-7           PIC X.
033500     02  WSFOUND8-1-8           PIC X.
033600     02  WSFOUND8-2-1           PIC X.
033700     02  WSFOUND8-2-2           PIC X.
033800     02  WSFOUND8-2-3           PIC X.
033900     02  WSFOUND8-2-4           PIC X.
034000     02  WSFOUND8-2-5           PIC X.
034100     02  WSFOUND8-2-6           PIC X.
034200     02  WSFOUND8-2-7           PIC X.
034300     02  WSFOUND8-2-8           PIC X.
034400     02  WSFOUND8-3-1           PIC X.
034500     02  FILLER                 PIC X(15).
034600*
034700 01  WSFOUNDWORD1-1 REDEFINES WSFOUNDWORD.
034800     02  WSFDIGIT               PIC X     OCCURS 8.
034900     02  FILLER                 PIC X(24).
035000*
035100 01  WSFOUNDWORD1A REDEFINES WSFOUNDWORD.
035200     02  WSFOUND8               PIC X(8)  OCCURS 4.
035300*
035400 01  HDR1.
035500     03  FILLER                 PIC X.
035600     03  FILLER                 PIC X(26)
035700         VALUE 'ACS Cobol Cross Reference '.
035800     03  H1PROG-NAME            PIC X(14).
035900     03  FILLER                 PIC X(20)
036000         VALUE 'Dictionary file for '.
036100     03  H1PROGRAMID            PIC X(30).
036200     03  H1DATE                 PIC X(8)     VALUE SPACES.
036300     03  FILLER                 PIC X(4)     VALUE SPACES.
036400     03  H1TIME                 PIC X(8)     VALUE SPACES.
036500     03  FILLER                 PIC X(6)     VALUE '  Page'.
036600     03  PAGE-X                 PIC ZZZ9.
036700*
036800 01  HDR4.
036900     03  FILLER                 PIC X.
037000     03  FILLER            PIC X(34) VALUE 'Data Names'.
037100     03  FILLER            PIC X(19) VALUE 'Defn     Reference'.
037200 01  HDTIME.
037300     03  HD-HH               PIC 99.
037400     03  HD-MM               PIC 99.
037500     03  HD-SS               PIC 99.
037600 01  HDTIMEB.
037700     03  HD2-HH              PIC 99.
037800     03  FILLER              PIC X   VALUE ':'.
037900     03  HD2-MM              PIC 99.
038000     03  FILLER              PIC X   VALUE ':'.
038100     03  HD2-SS              PIC 99.
038200 01  HDDATE.
038300     03  HD-M                PIC 99.
038400     03  FILLER              PIC X.
038500     03  HD-D                PIC 99.
038600     03  FILLER              PIC X.
038700     03  HD-Y                PIC 99.
038800 01  HDDATEB.
038900     03  HD2-D               PIC 99.
039000     03  FILLER              PIC X   VALUE '/'.
039100     03  HD2-M               PIC 99.
039200     03  FILLER              PIC X   VALUE '/'.
039300     03  HD2-Y               PIC 99.
039400 01  SECTTABLE.
039500     03  FILLER              PIC X(9)  VALUE 'FWLKCRSPI'.
039600 01  SECTTABLE2 REDEFINES SECTTABLE.
039700     03  LSECT               PIC X  OCCURS 9.
039800*
039810************
039900 01  XREF-ERROR-MESSAGES.
040000     03  XREF001      PIC X(44) VALUE
040100         'XREF001; Premature EOF on source input,EOJ!!'.
040200*     03  XREF002      PIC X(37) VALUE
040300*         'XREF002: JCL Error: File not present!'.
040400     03  XREF003      PIC X(34) VALUE
040500         'XREF003; No records present, EOJ!!'.
040510*     03  XREF005      PIC X(34) VALUE
040520*         'XREF005: Cannot find Copy Member'.
040590*
040600*************
040601*  PDS Support via NCZ93205 CBT Tape file 152
040602*
040604 01  WS-PDS-PARAMETERS.
040606     03  WS-PDS-REQUEST        PIC S9(8) COMP.
040610     03  WS-PDS-REQUEST-OPEN   PIC S9(8) COMP VALUE +0.
040615     03  WS-PDS-REQUEST-LOCATE PIC S9(8) COMP VALUE +4.
040620     03  WS-PDS-REQUEST-READ   PIC S9(8) COMP VALUE +8.
040625     03  WS-PDS-REQUEST-CLOSE  PIC S9(8) COMP VALUE +12.
040630     03  WS-PDS-MEMBER         PIC X(8).
040635     03  WS-PDS-RECORD         PIC X(255).
040640     03  FILLER REDEFINES WS-PDS-RECORD.
040645         05  WS-PDS-RECORD80   PIC X(80).
040650         05  FILLER              PIC X(75).
040655     03  WS-PDS-DDNAME         PIC X(8).
040690*
040695*************
040700 LINKAGE SECTION.
040800****************
040900 01  EXEC-PARAMETER.
041000     03  EXEC-PARAM-LENGTH   PIC S9(4) COMP.
041100* Get Repunch Param & Program name
041200     03  EXEC-PARAM-RESEQ    PIC X.
041300     03  EXEC-PARAM-PROGNAME PIC X(8).
041400*
041500 PROCEDURE DIVISION USING EXEC-PARAMETER.
041600 BEGINRUN.
041700     MOVE     PROG-NAME TO H1PROG-NAME.
041800     MOVE     CURRENT-DATE TO HDDATE.
041900     IF       HDDATE NOT = '000000'
042000              MOVE HD-Y TO HD2-Y
042100              MOVE HD-M TO HD2-M
042200              MOVE HD-D TO HD2-D
042300              MOVE HDDATEB TO H1DATE.
042400     MOVE     TIME-OF-DAY TO HDTIME.
042500     PERFORM  OPEN-SOURCE-FILE THRU READ-EXIT.
042600     OPEN     OUTPUT SUPPLEMENTAL-PART1-OUT SOURCE-LISTING.
042700*
042800 READLOOP1.
042900     PERFORM  READ-A-SOURCE-RECORD THRU READ-EXIT.
043000     PERFORM  INC-COBOLREFNO.
043100     PERFORM  OUTPUTSOURCE.
043200     IF       SV1PROGRAM-ID
043300              NOT = 'PROGRAM-ID.'
043400              GO TO READLOOP1.
043500*>     DISPLAY  'Pass 1/5'.
043600     MOVE     ZEROS TO WBUCKET.
043700     MOVE     SPACES TO SV3DPROG SV1PROGRAM-ID.
043800*
043900 EXAMINELOOP1.
044000     IF       SV1WHAT = 'DATA DIVISION.  '
044100              MOVE 'COBL' TO HOLDID1
044200*              DISPLAY  'PASS 2'
044300              GO TO READLOOP3.
044400     MOVE     ZERO TO TALLY.
044500     EXAMINE  SV3PROGRAMID TALLYING LEADING SPACES.
044600     MOVE     TALLY TO Q.
044700     IF       Q > 58
044800              PERFORM READ-A-SOURCE-RECORD THRU READ-EXIT
044900              PERFORM INC-COBOLREFNO
045000              PERFORM OUTPUTSOURCE
045100              GO TO EXAMINELOOP1.
045200*
045300 EXAMINELOOP2.
045400     ADD      1 TO WBUCKET.
045500     ADD      1 TO Q.
045600     IF       SV3-12 (Q) = '.'
045700              GO TO EXAMINELOOP3.
045800     MOVE     SV3-12 (Q) TO SV3-1 (WBUCKET).
045900     IF       WBUCKET NOT > 10
046000              GO TO EXAMINELOOP2.
046100*
046200 EXAMINELOOP3.
046300     MOVE     ZEROS TO WBUCKET.
046400     MOVE     SV3DPROG TO HOLDID H1PROGRAMID.
046500     GO       TO READLOOP2.
046600*
046700 INC-COBOLREFNO.
046800     IF       SEQUENCE-100
046900              ADD 100 TO COBOLREFNO
047000     ELSE
047100              ADD  10 TO COBOLREFNO.
047200     ADD      1 TO GEN-REFNO1.
047300     ADD      1 TO GEN-REFNO2.
047400*
047500 READLOOP2.
047600     PERFORM  READ-A-SOURCE-RECORD THRU READ-EXIT.
047700     PERFORM  INC-COBOLREFNO.
047800     PERFORM  OUTPUTSOURCE.
047900     IF       COBOLCONT = '*' OR '/'
048000              GO TO READLOOP2.
048100     IF       SV1WHAT
048200              NOT = 'DATA DIVISION.  '
048300              GO TO READLOOP2.
048400*     DISPLAY  'Pass 2/5'.
048500*
048600 READLOOP3.
048700*
048800*    Now for the data division
048900*
049000     PERFORM  READ-A-SOURCE-RECORD THRU READ-EXIT.
049100     PERFORM  INC-COBOLREFNO.
049200     PERFORM  OUTPUTSOURCE.
049300     IF       COBOLCONT = '*' OR '/'
049400              GO TO READLOOP3.
049500     IF       SV1WHAT = 'FILE SECTION.   '
049600              MOVE 1 TO HOLDWSORPD
049700              GO TO READLOOP3.
049800     IF       SV1WHAT = 'WORKING-STORAGE '
049900              MOVE 2 TO HOLDWSORPD
050000              GO TO READLOOP3.
050100     IF       SV1WHAT = 'LOCAL-STORAGE SE'
050200              MOVE 3 TO HOLDWSORPD
050300              GO TO READLOOP3.
050400     IF       SV1WHAT = 'LINKAGE SECTION.'
050500              MOVE 4 TO HOLDWSORPD
050600              GO TO READLOOP3.
050700     IF       SV1WHAT = 'COMMUNICATION SE'
050800              MOVE 5 TO HOLDWSORPD
050900              GO TO READLOOP3.
051000     IF       SV1WHAT = 'REPORT SECTION. '
051100              MOVE 6 TO HOLDWSORPD
051200              GO TO READLOOP3.
051300     IF       SV1WHAT = 'SCREEN SECTION. '
051400              MOVE 7 TO HOLDWSORPD
051500              GO TO READLOOP3.
051600     IF       SV1WHAT = 'PROCEDURE DIVISI'
051700              MOVE 8 TO HOLDWSORPD
051800              MOVE ZERO TO HOLDWSORPD2
051900*              ALTER ENDBRANCH TO PROCEED TO VALIDEND
052000              MOVE 'V' TO SW-ENDBRANCH
052100*              DISPLAY 'Pass 3/5'
052200              GO TO MAINLINE.
052300*
052400 RL3RESET.
052500*
052600*     These routines obtain the next word to be examined.
052700*
052800     MOVE     ZEROS TO COUNTSOURCEGROUP COUNTSOURCEDIGIT
052900                       COUNTFOUNDDIGIT  COUNTFOUNDGROUP.
053000     MOVE     SPACES TO WS8FOUND WSFOUNDWORD.
053100*     ALTER    RL3CHECKWORD TO PROCEED TO RL3CHECK1.
053200     MOVE     '1' TO SW-RL3CHECKWORD.
053300*
053400 RL3GETGROUP.
053500     IF       COUNTSOURCEGROUP = 8
053600              GO TO READLOOP3.
053700     PERFORM  LOADSOURCEGROUP THRU LSGEND.
053800*
053900 RL3GETDIGIT.
054000     IF       COUNTSOURCEDIGIT = 8
054100              MOVE ZERO TO COUNTSOURCEDIGIT
054200              GO TO RL3GETGROUP.
054300     PERFORM  LOADSOURCEDIGIT THRU LSDEND.
054400     IF       IGNORELEADSPACES = YES
054500        AND   THEDIGIT = SPACE OR ',' OR ';'
054600              MOVE SPACE TO THEDIGIT
054700              GO TO RL3GETDIGIT.
054800     MOVE     NOS TO IGNORELEADSPACES.
054900     IF       THEDIGIT = ',' OR ';'
055000              MOVE SPACE TO THEDIGIT.
055100     IF       THEDIGIT = SPACE OR '.'
055200              MOVE YES TO IGNORELEADSPACES
055300              GO TO RL3CHECKWORD.
055400*
055500 RL3STOREDIGIT.
055600     IF       COUNTFOUNDDIGIT = 8
055700              MOVE ZERO TO COUNTFOUNDDIGIT
055800              GO TO RL3STOREGROUP.
055900     PERFORM  SFD0 THRU SFDEND.
056000     GO       TO RL3GETDIGIT.
056100*
056200 RL3STOREGROUP.
056300     IF       COUNTFOUNDGROUP = 4
056400              GO TO READLOOP3.
056500     PERFORM  STOREFOUNDGROUP THRU SFGEND.
056600     GO       TO RL3STOREDIGIT.
056700*
056800 RL3CHECKWORD.
056900     IF       SW-RL3CHECKWORD = '2'
057000              GO TO RL3CHECK2
057100     ELSE
057200              GO TO RL3CHECK1.
057300*
057400 RL3CHECK1.
057500     PERFORM  STOREFOUNDGROUP THRU SFGEND.
057600     IF       WSF1-3 = 'FD '
057700          OR  'SD ' OR 'CD ' OR 'RD '
057800              GO TO RL3ISLEVEL.
057900     IF       WSF1-3 < '01 '
058000              GO TO READLOOP3.
058100     IF       WSF1-3 = '77 ' OR '88 ' OR '66 '
058200              GO TO RL3ISLEVEL.
058300     IF       WSF1-3 > '49 '
058400              GO TO READLOOP3.
058500*
058600 RL3ISLEVEL.
058700*     ALTER    RL3CHECKWORD TO PROCEED TO RL3CHECK2.
058800     MOVE     '2' TO SW-RL3CHECKWORD.
058900     MOVE     ZERO TO COUNTFOUNDDIGIT COUNTFOUNDGROUP.
059000     MOVE     SPACES TO WS8FOUND WSFOUNDWORD.
059100     MOVE     YES TO IGNORELEADSPACES.
059200     GO       TO RL3GETDIGIT.
059300*
059400 RL3CHECK2.
059500     PERFORM  STOREFOUNDGROUP THRU SFGEND.
059600     IF       WSF1-7 = 'FILLER ' OR 'LINE   '                     20151130
059700              GO TO RL3CLEARTOPERIOD.
059800*
059900 RL3BUILDANALYZER.
060000*
060100*    Writes data divn record containing dataname & level
060200*     i.e. FD, SD, 01-49, 66, 77, 88, CD
060300*   and convert word to upper case for sorting (NOT MVS/MVT COBOL)
060400*
060500     MOVE     SPACES TO SORTRECORD.
060600     MOVE     WSFOUNDWORD TO SKADATANAME.
060700*
060800*    the above could be wrong if most datanames are lowercase
060900*     but we will treat all datanames as upper (NOT MVS/MVT COBOL)
061000*
061100     MOVE     HOLDWSORPD  TO SKAWSORPD.
061200     MOVE     HOLDWSORPD2 TO SKAWSORPD2.
061300     MOVE     COBOLREFNO  TO SKAREFNO.
061400     WRITE    SORTRECORD.
061500     ADD      1 TO PRE-SORT-COUNT.
061600*
061700 RL3CLEARTOPERIOD.
061800     MOVE     ZERO TO TALLY.
061900     EXAMINE  SV3PROGRAMID TALLYING UNTIL FIRST '.'.
062000     MOVE     TALLY TO Q.
062100     IF       Q > 60
062200              PERFORM READLOOP3 THRU RL3RESET
062300              GO TO RL3CLEARTOPERIOD.
062400     IF       Q > 59
062500              GO TO READLOOP3.
062600     ADD      2 TO Q.
062700     IF       SV3-12 (Q) NOT = SPACE
062800              SUBTRACT 1 FROM Q
062900              MOVE SPACE TO SV3-12 (Q)
063000              GO TO RL3CLEARTOPERIOD.
063100     GO       TO READLOOP3.
063200*
063300 CHECKMORE.
063400*
063500*     At this point the data division has been read & broken down
063600*      with data div'n records written out.
063700*
063800     IF       THEDIGIT = '.'
063900              GO TO CHECKMORE2.
064000     IF       HOLDOVERLAPDIGIT = '.'
064100              GO TO CHECKMORE2.
064200     GO       TO GETINPUTGROUP.
064300*
064400 CHECKMORE2.
064500     MOVE     YES TO FOUNDPERIOD.
064600     IF       COBOLFORMA NOT = SPACES
064700              MOVE YES TO ISSTARTOFPARSEC ISPARSEC
064800              MOVE NOS TO HAVEPERIOD.
064900     MOVE     SPACE TO THEDIGIT HOLDOVERLAPDIGIT.
065000     PERFORM  GETINPUTGROUP.
065100     GO       TO OVERLAPENTER.
065200/
065300 MAINLINE.
065400*
065500*     From this point the procedure division is being examined
065600*
065700     MOVE     SPACES TO WS8DIGITS WS8FOUND WSFOUNDWORD.
065800     MOVE     SPACES TO THEDIGIT HOLDOVERLAPDIGIT.
065900     MOVE     ZERO TO WITHINPARENS-COUNT COUNTSOURCEGROUP
066000                      COUNTSOURCEDIGIT   COUNTFOUNDDIGIT
066100                      COUNTFOUNDGROUP.
066200     MOVE     YES TO IGNORELEADSPACES.
066300*
066400 CLEARWSWORDS.
066500     MOVE     SPACES TO WSFOUNDWORD.
066600*
066700 READALINE.
066800     PERFORM  READ-A-SOURCE-RECORD THRU READ-EXIT.
066900     PERFORM  INC-COBOLREFNO.
067000     PERFORM  OUTPUTSOURCE.
067100     IF       COBOLCONT = '*' OR '/'
067200              GO TO READALINE.
067300     IF       JUST-READ-A-PARAGRAPH-NAME = YES
067400              GO TO NOTEENT.
067500*
067600 NOTEENT.
067700*
067800* in this block we have found a declared para. Now what to do with
067900*
068000     IF       FINDPERIOD = YES
068100              GO TO CHECKMORE.
068200     IF       COBOLCONT = '-'
068300              MOVE YES TO IGNORELEADSPACES
068400              GO TO GETINPUTGROUP.
068500     IF       WITHINPARENS = YES
068600              PERFORM LOADSOURCEGROUP THRU LSGEND
068700              MOVE HOLDOVERLAPDIGIT TO THEDIGIT
068800              GO TO GETINPUTDIGIT2.
068900     IF       ISFIRSTCARDAPARAGRAPH = YES
069000       AND    COBOLFORMA = SPACES
069100              MOVE NOS TO ISFIRSTCARDAPARAGRAPH
069200              MOVE YES TO ISPARSEC HAVEPERIOD
069300              GO TO HAVEPARSEC.
069400     MOVE     NOS TO ISFIRSTCARDAPARAGRAPH.
069500     IF       COBOLFORMA NOT = SPACES
069600              MOVE YES TO ISSTARTOFPARSEC ISPARSEC
069700              MOVE NOS TO HAVEPERIOD.
069800     IF       THEDIGIT = ',' OR ';'
069900              MOVE SPACE TO THEDIGIT.
070000     IF       SPACE = THEDIGIT AND HOLDOVERLAPDIGIT
070100              GO TO GETINPUTGROUP.
070200     IF       IGNORELEADSPACES = NOS
070300        AND   HOLDOVERLAPDIGIT = SPACE
070400              PERFORM LOADSOURCEGROUP THRU LSGEND
070500              PERFORM STOREFOUNDGROUP THRU SFGEND
070600              MOVE NOS TO DIDHAVEPERIOD
070700              GO TO OVERLAPENTER.
070800     IF       '.' = THEDIGIT OR HOLDOVERLAPDIGIT
070900              MOVE YES TO FOUNDPERIOD HAVEPERIOD
071000              PERFORM LOADSOURCEGROUP THRU LSGEND
071100              PERFORM STOREFOUNDGROUP THRU SFGEND
071200              MOVE NOS TO DIDHAVEPERIOD
071300              GO TO OVERLAPENTER.
071400     IF       HOLDOVERLAPDIGIT = QUOTE
071500              MOVE WAS TO WITHINQUOTES.
071600     IF       HOLDOVERLAPDIGIT = ')'
071700              PERFORM DECREMENT-WITHINPARENS-COUNT.
071800     PERFORM  LOADSOURCEGROUP THRU LSGEND.
071900     MOVE     HOLDOVERLAPDIGIT TO THEDIGIT.
072000     PERFORM  STOREFOUNDDIGIT THRU SFDEND.
072100     IF       COUNTFOUNDDIGIT = 9
072200              MOVE ZERO TO COUNTFOUNDDIGIT
072300              PERFORM STOREFOUNDGROUP THRU SFGEND
072400              PERFORM STOREFOUNDDIGIT THRU SFDEND.
072500     PERFORM  STOREFOUNDGROUP THRU SFGEND.
072600     GO       TO OVERLAPENTER.
072700*
072800 GETINPUTGROUP.
072900     IF       COUNTSOURCEGROUP = 8
073000              MOVE ZERO TO COUNTSOURCEGROUP
073100              MOVE SV2-65 TO HOLDOVERLAPDIGIT
073200              GO TO READALINE.
073300     PERFORM  LOADSOURCEGROUP THRU LSGEND.
073400     IF       IGNORELEADSPACES = YES
073500         AND  WS8DIGITS = SPACES
073600              GO TO GETINPUTGROUP.
073700*
073800 GETINPUTDIGIT.
073900     IF       COUNTSOURCEDIGIT = 8
074000              MOVE ZERO TO COUNTSOURCEDIGIT
074100              GO TO GETINPUTGROUP.
074200     PERFORM  LOADSOURCEDIGIT THRU LSDEND.
074300*
074400 GETINPUTDIGIT2.
074500     IF       FINDPERIOD = YES
074600              GO TO NOTE-TEST.
074700     IF       THEDIGIT = '.'
074800              MOVE YES TO FOUNDPERIOD.
074900     IF       IGNORELEADSPACES = YES
075000       AND    THEDIGIT = SPACE
075100              GO TO GETINPUTDIGIT.
075200     MOVE     NOS TO IGNORELEADSPACES.
075300     IF       THEDIGIT = QUOTE
075400        AND   WITHINQUOTES = NOS
075500              MOVE GOT TO WITHINQUOTES.
075600*
075700     IF       (WITHINQUOTES = NOS OR WAS)
075800         AND  THEDIGIT = '('
075900              GO TO INCREMENT-WITHINPARENS-COUNT.
076000     IF       FLAG-TO-SIGNAL-SUBSCRIPT = MAY
076100              MOVE NOS TO FLAG-TO-SIGNAL-SUBSCRIPT.
076200*
076300     IF       (WITHINQUOTES = WAS OR NOS)
076400         AND  THEDIGIT = ')'
076500              GO TO DECREMENT-WITHINPARENS-COUNT.
076600     GO       TO CONTINUE-TEST-DIGIT.
076700*
076800 INCREMENT-WITHINPARENS-COUNT.
076900     ADD      1 TO WITHINPARENS-COUNT.
077000     IF       WITHINPARENS-COUNT = 1
077100              MOVE YES TO WITHINPARENS.
077200     IF       WITHINPARENS-COUNT = 1
077300        AND   FLAG-TO-SIGNAL-SUBSCRIPT = MAY
077400              MOVE YES TO FLAG-TO-SIGNAL-SUBSCRIPT.
077500     GO       TO CONTINUE-TEST-DIGIT.
077600*
077700 DECREMENT-WITHINPARENS-COUNT.
077800     IF       COBOLCONT = '-'
077900              GO TO CONTINUE-TEST-DIGIT.
078000     SUBTRACT 1 FROM WITHINPARENS-COUNT.
078100     IF       WITHINPARENS-COUNT = ZERO
078200              MOVE WAS TO WITHINPARENS
078300              MOVE NOS TO WITHINQUOTES.
078400*
078500 CONTINUE-TEST-DIGIT.
078600     IF       THEDIGIT = ','
078700              MOVE SPACE TO THEDIGIT.
078800     IF       COBOLCONT = '-' AND THEDIGIT = QUOTE
078900              MOVE HOLDOVERLAPDIGIT TO THEDIGIT
079000              MOVE SPACE TO COBOLCONT
079100              GO TO STOREOUTDIGIT.
079200     IF       COBOLCONT = '-' AND THEDIGIT NOT = QUOTE
079300              MOVE HOLDOVERLAPDIGIT TO THEDIGIT
079400              MOVE SPACE TO COBOLCONT
079500              SUBTRACT 1 FROM COUNTSOURCEDIGIT
079600              GO TO STOREOUTDIGIT.
079700     IF       WITHINQUOTES = GOT
079800              MOVE YES TO WITHINQUOTES
079900              GO TO STOREOUTDIGIT.
080000     IF       THEDIGIT = SPACE AND WITHINQUOTES = YES
080100              GO TO STOREOUTDIGIT.
080200     IF       THEDIGIT = QUOTE AND WITHINQUOTES = YES
080300              MOVE WAS TO WITHINQUOTES
080400              GO TO STOREOUTDIGIT.
080500     IF       THEDIGIT = SPACE AND WITHINPARENS = YES
080600              GO TO STOREOUTDIGIT.
080700     IF       THEDIGIT = SPACE
080800              MOVE NOS TO DIDHAVEPERIOD
080900              GO TO HAVEAWORD.
081000     IF       THEDIGIT = '(' OR ')'
081100              GO TO GETINPUTDIGIT.
081200     IF       DIDHAVEPERIOD = YES
081300              MOVE WAS TO DIDHAVEPERIOD
081400              MOVE '.' TO THEDIGIT
081500              SUBTRACT 1 FROM COUNTSOURCEDIGIT.
081600*
081700 STOREOUTDIGIT.
081800     IF       COUNTFOUNDDIGIT = 8
081900              MOVE ZERO TO COUNTFOUNDDIGIT
082000              GO TO STOREOUTGROUP.
082100     PERFORM  STOREFOUNDDIGIT THRU SFDEND.
082200     GO       TO GETINPUTDIGIT.
082300*
082400 NOTE-TEST.
082500     IF       THEDIGIT = '.'
082600              MOVE YES TO FOUNDPERIOD
082700              MOVE SPACE TO THEDIGIT HOLDOVERLAPDIGIT
082800              GO TO OVERLAPENTER.
082900     GO       TO GETINPUTDIGIT.
083000*
083100 STOREOUTGROUP.
083200     PERFORM  STOREFOUNDGROUP THRU SFGEND.
083300     IF       COUNTFOUNDGROUP = 4
083400              MOVE ZERO TO COUNTFOUNDGROUP
083500              PERFORM SFWEND.
083600     GO       TO STOREOUTDIGIT.
083700*
083800 HAVEAWORD.
083900     MOVE     NOS TO NUMERIC-PARAGRAPH-SWITCH.
084000     IF       JUST-READ-A-PARAGRAPH-NAME = YES
084100              MOVE NOS TO JUST-READ-A-PARAGRAPH-NAME.
084200     IF       YES = FINDPERIOD AND FOUNDPERIOD
084300              MOVE NOS TO FINDPERIOD FLAG-TO-SIGNAL-SUBSCRIPT
084400              GO TO KILLWORD.
084500     MOVE     NOS TO FOUNDPERIOD.
084600     IF       FINDPERIOD = YES
084700              MOVE NOS TO FLAG-TO-SIGNAL-SUBSCRIPT
084800              GO TO KILLWORD.
084900     PERFORM  STOREFOUNDGROUP THRU SFGEND.
085000     IF       NUMERIC-PARAGRAPH-SWITCH = YES
085100              GO TO DO-YOU-WANT-TO-TURN-OFF.
085200     GO       TO PASS-TURN-OFF-TEST.
085300*
085400 DO-YOU-WANT-TO-TURN-OFF.
085500     IF       WSF1-1 NOT NUMERIC
085600              MOVE NOS TO NUMERIC-PARAGRAPH-SWITCH.
085700*
085800 PASS-TURN-OFF-TEST.
085900     IF       ISPARSEC = YES
086000              MOVE NOS TO FLAG-TO-SIGNAL-SUBSCRIPT
086100              GO TO HAVEPARSEC.
086200     MOVE     NOS TO ISSTARTOFPARSEC.
086300*
086400 OVERLAPENTER.
086500     IF       YES = FINDPERIOD AND FOUNDPERIOD
086600              MOVE NOS TO FINDPERIOD FLAG-TO-SIGNAL-SUBSCRIPT
086700              GO TO KILLWORD.
086800     IF       FINDPERIOD = YES
086900              MOVE NOS TO FLAG-TO-SIGNAL-SUBSCRIPT
087000              GO TO KILLWORD.
087100     IF       YES = WITHINPARENS AND FLAG-TO-SIGNAL-SUBSCRIPT
087200              MOVE NOS TO FLAG-TO-SIGNAL-SUBSCRIPT WITHINPARENS
087300              GO TO HAVESUBSCRIPT.
087400     IF       WITHINPARENS = WAS
087500              MOVE NOS TO WITHINPARENS
087600              GO TO STOREWORD.
087700     MOVE     NOS TO FLAG-TO-SIGNAL-SUBSCRIPT.
087800     IF       WITHINQUOTES = WAS
087900              MOVE NOS TO WITHINQUOTES
088000              GO TO STOREWORD.
088100     IF       ISNUMERICLITERAL = YES
088200              GO TO STOREWORD.
088300     IF       WSF1-7 = 'SPACE  '
088400         OR   'SPACES ' OR 'ZERO   '
088500         OR   'ZEROS  ' OR 'ZEROES ' OR 'QUOTE  ' OR 'QUOTES '
088600              GO TO STOREWORD.
088700     GO       TO CHECKTHEWORD.
088800*
088900 DELETENOTE.
089000     IF       ISSTARTOFPARSEC NOT = YES
089100              MOVE YES TO FINDPERIOD
089200              GO TO KILLWORD.
089300     PERFORM  READ-A-SOURCE-RECORD THRU READ-EXIT.
089400     PERFORM  INC-COBOLREFNO.
089500     PERFORM  OUTPUTSOURCE.
089600     IF       COBOLFORMA = SPACES OR
089700              COBOLCONT = '*' OR '/'
089800              GO TO DELETENOTE.
089900     MOVE     ZERO TO COUNTSOURCEGROUP COUNTSOURCEDIGIT
090000                      COUNTFOUNDDIGIT COUNTFOUNDGROUP.
090100     MOVE     SPACES TO WS8FOUND WSFOUNDWORD THEDIGIT
090200                        HOLDOVERLAPDIGIT.
090300     MOVE     NOS TO ISSTARTOFPARSEC.
090400*     ALTER    SFDSWITCH TO PROCEED TO SFDTEST.
090500     MOVE     'T' TO SW-SFDSWITCH.
090600     GO       TO NOTEENT.
090700*
090800 HAVEPARSEC.
090900     IF       SW-HAVEPARSEC = '3'
091000              GO TO PARTEST3.
091100     IF       SW-HAVEPARSEC = '2'
091200              GO TO PARTEST2
091300     ELSE
091400              GO TO PARTEST1.
091500*
091600 PARTEST1.
091700     IF       WSF1-13 = 'DECLARATIVES '
091800           OR 'DECLARATIVES.'
091900              MOVE NOS TO ISPARSEC
092000              GO TO KILLWORD.
092100     IF       WSF1-4 = 'END ' OR
092200              WSF1-5 = 'END. '
092300              GO TO KILLWORD.
092400     IF       HAVEPERIOD NOT = YES
092500              GO TO PARTE22.
092600     MOVE     NOS TO ISPARSEC.
092700     PERFORM  BUILDANALYZER.
092800* this does not look if its needed ??????
092900*     PERFORM  INC-COBOLREFNO.
093000     MOVE     YES TO JUST-READ-A-PARAGRAPH-NAME.
093100     GO       TO KILLWORD.
093200*
093300 PARTE22.
093400     MOVE     WSFOUNDWORD TO HOLDSECNAME.
093500     PERFORM  BUILDANALYZER.
093600*     ALTER    HAVEPARSEC TO PROCEED TO PARTEST2.
093700     MOVE     '2' TO SW-HAVEPARSEC.
093800     GO       TO KILLWORD.
093900*
094000 PARTEST2.
094100     IF       HAVEPERIOD = YES
094200              MOVE SPACES TO WSFOUNDWORD
094300              GO TO PARTEST3.
094400*     ALTER    HAVEPARSEC TO PROCEED TO PARTEST3.
094500     MOVE     '3' TO SW-HAVEPARSEC.
094600     GO       TO KILLWORD.
094700*
094800 PARTEST3.
094900*     ALTER    HAVEPARSEC TO PROCEED TO PARTEST1.
095000     MOVE     '1' TO SW-HAVEPARSEC.
095100     MOVE     NOS TO ISPARSEC.
095200     MOVE     SPACES TO SORTRECORD.
095300     MOVE     HOLDSECNAME TO SKADATANAME.
095400     MOVE     COBOLREFNO TO SKAREFNO.
095500     MOVE     HOLDWSORPD TO SKAWSORPD.
095600     MOVE     HOLDWSORPD2 TO SKAWSORPD2.
095700     WRITE    SORTRECORD.
095800     ADD      1 TO PRE-SORT-COUNT.
095900* this does not look if its needed ??????
096000*     PERFORM  INC-COBOLREFNO.
096100     MOVE     YES TO JUST-READ-A-PARAGRAPH-NAME.
096200*
096300*>>  may be need to tell sortrecord this is a declared paragraph
096400*   name but is it the paragraph?,  if not here, then where?
096500*
096600     GO       TO KILLWORD.
096700*
096800 HAVESUBSCRIPT.
096900     MOVE     WSFOUNDWORD TO SKADATANAME.
097000     MOVE     HOLDWSORPD TO SKAWSORPD.
097100     MOVE     HOLDWSORPD2 TO SKAWSORPD2.
097200     MOVE     COBOLREFNO TO SKAREFNO.
097300     WRITE    SORTRECORD.
097400     ADD      1 TO PRE-SORT-COUNT.
097500     GO       TO STOREWORD.
097600*
097700 CHECKTHEWORD.
097800     IF       WSFOUND8-1-3 = SPACE  GO TO CHECK2.
097900     IF       WSFOUND8-1-4 = SPACE  GO TO CHECK3.
098000     IF       WSFOUND8-1-5 = SPACE  GO TO CHECK4.
098100     IF       WSFOUND8-1-6 = SPACE  GO TO CHECK5.
098200     IF       WSFOUND8-1-7 = SPACE  GO TO CHECK6.
098300     IF       WSFOUND8-1-8 = SPACE  GO TO CHECK7.
098400     IF       WSFOUND8-2-1 = SPACE  GO TO CHECK8.
098500     IF       WSFOUND8-2-2 = SPACE  GO TO CHECK9.
098600     IF       WSFOUND8-2-3 = SPACE  GO TO CHECK10.
098700     IF       WSFOUND8-2-4 = SPACE  GO TO CHECK11.
098800     IF       WSFOUND8-2-5 = SPACE  GO TO CHECK12.
098900     IF       WSFOUND8-2-6 = SPACE  GO TO CHECK13.
099000*
099100 BUILDANALYZER.
099200     MOVE     MAY TO FLAG-TO-SIGNAL-SUBSCRIPT.
099300     MOVE     SPACES TO SORTRECORD.
099400     MOVE     WSFOUNDWORD TO SKADATANAME.
099500     MOVE     HOLDWSORPD TO SKAWSORPD.
099600     MOVE     HOLDWSORPD2 TO SKAWSORPD2.
099700     MOVE     COBOLREFNO TO SKAREFNO.
099800     WRITE    SORTRECORD.
099900     ADD      1 TO PRE-SORT-COUNT.
100000*
100100 STOREWORD.
100200     PERFORM  SFWEND.
100300     MOVE     YES TO IGNORELEADSPACES.
100400*     ALTER    SFDSWITCH TO PROCEED TO SFDTEST.
100500     MOVE     'T' TO SW-SFDSWITCH.
100600     GO       TO GETINPUTDIGIT.
100700*
100800 KILLWORD.
100900     GO       TO STOREWORD.
101000*
101100 CHECK2.
101200*
101300*    force words to upper case for OC
101400*
101500     IF       WSF1-3 = 'IN' OR 'OF'
101600              GO TO STOREWORD.
101700     IF       WSF1-3 = '** ' OR '*  ' OR '=  ' OR '+  '
101800        OR    '-  ' OR '<  ' OR '>  ' OR '/  ' OR '>= '
101900        OR    '=> ' OR '<= ' OR '=< ' OR '<> '
102000              GO TO STOREWORD.
102100     IF       WSF1-3 = 'GO '
102200              MOVE YES TO NUMERIC-PARAGRAPH-SWITCH.
102300     IF       WSF1-3 = 'IF ' OR 'GO '
102400              GO TO YESVERB.
102500     IF       WSF1-3 = 'IS '
102600           OR 'ON ' OR 'AT '
102700              GO TO KILLWORD.
102800     IF       WSF1-3 = NOS
102900           OR 'BY ' OR 'OR '
103000              GO TO STOREWORD.
103100     IF       HOLDVERB = 'IF  '
103200          AND WSF1-3 = 'TO '
103300              GO TO KILLWORD.
103400     IF       HOLDVERB = 'GO  '
103500          AND WSF1-3 = 'TO '
103600              MOVE YES TO NUMERIC-PARAGRAPH-SWITCH.
103700     IF       WSF1-3 = 'TO '
103800              GO TO STOREWORD.
103900     IF       WSF1-3 = 'UP '
104000              GO TO STOREWORD.
104100*
104200 CHECK2UNKNOWN.
104300     GO       TO BUILDANALYZER.
104400*
104500 CHECK3.
104600     IF       WSF1-4 = 'ADD '
104700        OR    'SET ' OR 'USE '
104800              GO TO YESVERB.
104900     IF       WSF1-4 = 'ALL '
105000        OR    'AND ' OR 'EOP ' OR 'FOR ' OR 'I-O ' OR 'NOT '
105100        OR    'RUN '
105200              GO TO STOREWORD.
105300     IF       WSF1-4 = 'END ' OR 'KEY '
105400              GO TO BREAKWORD.
105500*
105600 CHECK3UNKNOWN.
105700     GO       TO BUILDANALYZER.
105800*
105900 CHECK4.
106000     IF       WSF1-5 = 'CALL '
106100         OR   'COPY ' OR 'EXIT ' OR 'MOVE '
106200         OR   'OPEN ' OR 'READ ' OR 'SEEK ' OR 'SORT ' OR 'WHEN '
106300         OR   'STOP '
106400              GO TO YESVERB.
106500     IF       WSF1-5 = 'CORR '
106600         OR   'DISP ' OR 'DOWN ' OR 'FROM ' OR 'INTO '
106700         OR   'KEYS ' OR 'LESS ' OR 'LOCK ' OR 'REEL ' OR 'THRU '
106800         OR   'UNIT ' OR 'UPON '
106900              GO TO STOREWORD.
107000     IF       WSF1-5 = 'SIZE ' OR 'ELSE '
107100              GO TO BREAKWORD.
107200     IF       WSF1-5 = 'NEXT '
107300         OR   'THAN ' OR 'THEN ' OR 'WITH '
107400              GO TO KILLWORD.
107500*
107600 CHECK4UNKNOWN.
107700     GO       TO BUILDANALYZER.
107800*
107900 CHECK5.
108000     IF       WSF1-6 = 'ALTER '
108100              MOVE YES TO NUMERIC-PARAGRAPH-SWITCH.
108200*
108300     IF       WSF1-6 = 'ALTER '
108400         OR   'CLOSE ' OR 'DEBUG ' OR 'ENTER ' OR 'ENTRY '
108500         OR   'READY ' OR 'START ' OR 'TRACE ' OR 'WRITE '
108600              GO TO YESVERB.
108700     IF       WSF1-6 = 'AFTER ' OR 'ERROR ' OR 'FIRST '
108800         OR   'INPUT ' OR 'TIMES ' OR 'USING '
108900              GO TO STOREWORD.
109000     IF       WSF1-6 = 'EQUAL ' OR 'EVERY ' OR 'LABEL '
109100         OR   'LINES ' OR 'QUOTE ' OR 'UNTIL '
109200              GO TO STOREWORD.
109300     IF       WSF1-6 = 'EJECT ' OR 'LEAVE ' OR 'NAMED '
109400         OR   'SKIP1 ' OR 'SKIP2 ' OR 'SKIP3 '
109500         OR   'SYSIN ' OR 'TRACE '
109600              GO TO STOREWORD.
109700*
109800 CHECK5UNKNOWN.
109900     GO       TO BUILDANALYZER.
110000*
110100 CHECK6.
110200     IF       WSF1-7 = 'ACCEPT '
110300         OR   'DIVIDE ' OR 'RETURN ' OR 'SEARCH '
110400              GO TO YESVERB.
110500     IF       WSF1-7 = 'GIVING ' OR 'GOBACK '
110600         OR   'REWIND ' OR 'OUTPUT ' OR 'BEFORE ' OR 'ENDING '
110700         OR   'QUOTES ' OR 'REREAD ' OR 'SYSOUT '
110800              GO TO STOREWORD.
110900     IF       WSF1-7 = 'RECORD '
111000              GO TO KILLWORD.
111100*
111200 CHECK6UNKNOWN.
111300     GO       TO BUILDANALYZER.
111400*
111500 CHECK7.
111600     IF       WSF1-8 = 'PERFORM '
111700              MOVE YES TO NUMERIC-PARAGRAPH-SWITCH.
111800     IF       WSF1-8 = 'DISPLAY '
111900         OR   'PERFORM ' OR 'EXAMINE ' OR 'RELEASE '
112000         OR   'COMPUTE ' OR 'EXHIBIT '
112100*        OR 'INSPECT '
112200              GO TO YESVERB.
112300*
112400     IF       WSF1-8 = 'SECTION '
112500         OR   'NUMERIC ' OR 'ROUNDED ' OR 'PROCEED '
112600         OR   'LEADING ' OR 'VARYING ' OR 'THROUGH '
112700         OR   'GREATER ' OR 'CONSOLE ' OR 'CHANGED ' OR 'PROGRAM '
112800              GO TO STOREWORD.
112900     IF       WSF1-8 = 'INVALID'
113000              GO TO KILLWORD.
113100*
113200 CHECK7UNKNOWN.
113300     GO       TO BUILDANALYZER.
113400*
113500 CHECK8.
113600     IF       WSF1-9 = 'MULTIPLY '
113700         OR   'GENERATE ' OR 'INITIATE ' OR 'SUBTRACT '
113800              GO TO YESVERB.
113900     IF       WSF1-9 = 'SENTENCE '
114000              GO TO KILLWORD.
114100     IF       WSF1-9 = 'POSITIVE '
114200         OR   'NEGATIVE ' OR 'REVERSED ' OR 'TALLYING '
114300         OR   'STANDARD ' OR 'SYSPUNCH '
114400              GO TO STOREWORD.
114500*
114600 CHECK8UNKNOWN.
114700     GO       TO BUILDANALYZER.
114800*
114900 CHECK9.
115000     IF       WSF1-10 = 'TRANSFORM '
115100         OR   'TERMINATE '
115200              GO TO YESVERB.
115300     IF       WSF1-10 = 'PROCEDURE '
115400         OR   'REPLACING ' OR 'ASCENDING ' OR 'DEPENDING '
115500         OR   'ADVANCING ' OR 'LOW-VALUE ' OR 'BEGINNING '
115600         OR   'REMAINDER ' OR 'REPORTING '
115700              GO TO STOREWORD.
115800     IF       WSF1-10 = 'OTHERWISE '
115900              MOVE 'ELSE ' TO WSF1-5
116000              GO TO BREAKWORD.
116100*
116200 CHECK9UNKNOWN.
116300     GO       TO BUILDANALYZER.
116400*
116500 CHECK10.
116600     IF       WSF1-11 = 'ALPHABETIC '
116700         OR   'DESCENDING ' OR 'HIGH-VALUE ' OR 'LOW-VALUES '
116800         OR   'CHARACTERS '
116900              GO TO STOREWORD.
117000*
117100 CHECK10UNKNOWN.
117200     GO       TO BUILDANALYZER.
117300*
117400 CHECK11.
117500     IF       WSF1-12 = 'HIGH-VALUES '
117600         OR   'END-OF-PAGE ' OR 'POSITIONING '
117700              GO TO STOREWORD.
117800*
117900 CHECK11UNKNOWN.
118000     GO       TO BUILDANALYZER.
118100*
118200 CHECK12.
118300     IF       WSF1-13 = 'INPUT-OUTPUT '
118400              GO TO STOREWORD.
118500*
118600 CHECK12UNKNOWN.
118700     GO       TO BUILDANALYZER.
118800*
118900 CHECK13.
119000     IF       WSF1-14 = 'CORRESPONDING '
119100              GO TO STOREWORD.
119200*
119300 CHECK13UNKNOWN.
119400     GO       TO BUILDANALYZER.
119500*
119600 LOADSOURCEGROUP.
119700     ADD      1 TO COUNTSOURCEGROUP.
119800     MOVE     SV2 (COUNTSOURCEGROUP) TO WS8DIGITS.
119900*
120000 LSGEND.
120100     EXIT.
120200*
120300 LOADSOURCEDIGIT.
120400     ADD      1 TO COUNTSOURCEDIGIT.
120500     MOVE     WS8DIGIT (COUNTSOURCEDIGIT) TO THEDIGIT.
120600*
120700 LSDEND.
120800     EXIT.
120900*
121000 STOREFOUNDDIGIT.
121100     IF       WITHINQUOTES = YES
121200              GO TO SFD0.
121300     IF       DIDHAVEPERIOD = WAS
121400              MOVE NOS TO DIDHAVEPERIOD HAVEPERIOD
121500              GO TO SFD0.
121600     IF       THEDIGIT = '.'
121700              MOVE YES TO HAVEPERIOD DIDHAVEPERIOD
121800              GO TO SFDEND.
121900     IF       THEDIGIT = '+' OR '-'
122000              GO TO SFD0.
122100*
122200 SFDSWITCH.
122300     IF       SW-SFDSWITCH = '0'
122400              GO TO SFD0
122500     ELSE
122600              GO TO SFDTEST.
122700*
122800 SFDTEST.
122900     IF       NUMERIC-PARAGRAPH-SWITCH = YES
123000              GO TO SFD01.
123100     IF       THEDIGIT IS NUMERIC OR
123200              THEDIGIT = '.' OR '+' OR '-'
123300              MOVE YES TO ISNUMERICLITERAL
123400              GO TO SFD0.
123500*
123600 SFD01.
123700     MOVE     NOS TO ISNUMERICLITERAL.
123800*     ALTER    SFDSWITCH TO PROCEED TO SFD0.
123900     MOVE     '0' TO SW-SFDSWITCH.
124000*
124100 SFD0.
124200     ADD      1 TO COUNTFOUNDDIGIT.
124300     MOVE     THEDIGIT TO WSFOUND (COUNTFOUNDDIGIT).
124400*
124500 SFDEND.
124600     EXIT.
124700*
124800 STOREFOUNDGROUP.
124900     ADD      1 TO COUNTFOUNDGROUP.
125000     MOVE     WS8FOUND TO WSFOUND8 (COUNTFOUNDGROUP).
125100*
125200 SFGEND.
125300     MOVE     SPACES TO WS8FOUND.
125400*
125500 SFWEND.
125600     MOVE     SPACES TO WSFOUNDWORD WS8FOUND.
125700     MOVE     ZEROES TO COUNTFOUNDDIGIT COUNTFOUNDGROUP.
125800*
125900 YESVERB.
126000     IF     SW-YESVERB = 'N'
126100            GO TO NEXTVERB
126200      ELSE   GO TO FIRSTVERB.
126300*
126400 FIRSTVERB.
126500     MOVE     WSF1-8 TO HOLDVERB.
126600     MOVE     'N' TO SW-YESVERB.
126700*     ALTER    YESVERB TO PROCEED TO NEXTVERB.
126800     GO       TO STOREWORD.
126900*
127000 NEXTVERB.
127100 BREAKWORD.
127200     MOVE     NOS TO HAVEPERIOD.
127300*
127400 LINESTATEEND.
127500     MOVE     WSF1-8 TO HOLDVERB.
127600*
127700 RESETUP.
127800     MOVE     ZERO TO COUNTFOUNDDIGIT COUNTFOUNDGROUP.
127900     MOVE     SPACES TO WSFOUNDWORD WS8FOUND.
128000     MOVE     YES TO IGNORELEADSPACES.
128100*
128200 ENDSWITCH.
128300     IF       SW-ENDSWITCH = 'T'
128400              GO TO TERMINATERUN
128500     ELSE
128600              GO TO GETINPUTDIGIT.
128700*
128800 ENDBRANCH.
128900     IF       SW-ENDBRANCH = 'V'
129000              GO TO VALIDEND
129100     ELSE
129200              GO TO INVALIDEND.
129300*
129400 INVALIDEND.
129500     DISPLAY  XREF001.
129600     MOVE     8 TO RETURN-CODE.
129700     STOP     RUN.
129800*
129900 VALIDEND.
130000     MOVE     'T' TO SW-ENDSWITCH.
130100*     ALTER    ENDSWITCH TO PROCEED TO TERMINATERUN.
130200     GO       TO YESVERB.
130300*
130400 TERMINATERUN.
130500     CLOSE    SUPPLEMENTAL-PART1-OUT.
130600     CLOSE    SOURCEINPUT.
130700     IF       PUNCH-SOURCE
130800              CLOSE REBUILD-SOURCE.
130900     GO       TO BEGINLASTPASS.
131000*
131100 OUTPUTSOURCE.
131200     PERFORM  WRITEHDB THRU HDB-EXIT.
131300     MOVE     SPACES TO SOURCE-LIST.
131400     MOVE     SOURCERECIN TO SOURCEOUTPUT.
131500     MOVE     GEN-REFNO1 TO SL-GEN-REFNO1.
131600     MOVE     GEN-REFNO2 TO SL-GEN-REFNO2.
131700*
131800* Remove the copy depth stuff as no copy libs used at the moment
131900*
132000      MOVE SPACES TO SL-COPYGENX.
132100*     MOVE     '[00]: ' TO SL-COPYGENX.
132200*     MOVE     COPY-DEPTH TO SL-COPY-DEPTH.
132300     WRITE    SOURCE-LIST AFTER 1.
132400     ADD      1 TO LCONB.
132500*
132600     IF       PUNCH-SOURCE
132700              MOVE SOURCERECIN TO SOURCERECOUT
132800              MOVE COBOLREFNO TO SRO-SEQNO
132900              WRITE SOURCERECOUT.
133000*
133100 OPEN-SOURCE-FILE.
133200*
133300     IF       EXEC-PARAM-LENGTH > +0
133400       AND    EXEC-PARAM-RESEQ = 'R' OR = 'C'
133500              DISPLAY ' Reseqencing Program '
133600              MOVE 'Y' TO SW-2
133700              IF   EXEC-PARAM-RESEQ = 'C'
133800                   MOVE 'Y' TO SW-4
133900                   DISPLAY 'with 100 Increments'
134000              ELSE
134100                   DISPLAY 'with 10 Increments'.
134200*
134300     IF       EXEC-PARAM-LENGTH > +3
134400       AND    EXEC-PARAM-PROGNAME NOT = SPACES
134500              MOVE EXEC-PARAM-PROGNAME TO H1PROGRAMID
134600     ELSE
134700              MOVE 'COBL' TO H1PROGRAMID.
134800*
134900* Above Temp program name until we get PROGRAM-ID etc
135000*
135100     OPEN     INPUT SOURCEINPUT.
135110*
135120* removed FS-STATUS as no file status facility on file SELECTS in
135125*   ANSI Cobol so no error capture ....
135130*
135200*     IF       FS-REPLY NOT = '00'
135300*              DISPLAY XREF002
135400*              MOVE 1 TO RETURN-CODE
135500*              STOP RUN.
135600     IF       PUNCH-SOURCE
135700              OPEN OUTPUT REBUILD-SOURCE.
135800*
135900     GO       TO READ-EXIT.
136000*
136100 READ-A-SOURCE-RECORD.
136200     READ     SOURCEINPUT INTO SOURCEINWS AT END
136300              GO TO ENDBRANCH.
136400*
136500 READ-EXIT.
136600     EXIT.
136700*
136800/
136900 BEGINLASTPASS.
137000     MOVE     PRE-SORT-COUNT TO SORT-FILE-SIZE.
137100*     DISPLAY  'Pass 4/5, Sorting...Please Wait'.
137200*       MOVE     PRE-SORT-COUNT TO SORT-RETURN-9.
137300*       DISPLAY 'Will be Sorting ' SORT-RETURN-9 ' Records'.
137400     SORT     SORTFILE
137500              ASCENDING KEY SDSORTKEY
137600              USING  SUPPLEMENTAL-PART1-OUT
137700              GIVING SUPPLEMENTAL-PART2-IN.
137800*
137900     IF       SORT-RETURN NOT = ZERO
138000              MOVE SORT-RETURN TO RETURN-CODE
138100*                                 SORT-RETURN-9
138200*           DISPLAY 'SORT ERROR: ' SORT-RETURN-9
138300              GO TO WRAPUP.
138400*
138500*     DISPLAY  'Pass 5/5'.
138600     MOVE     'N' TO SW-3.
138700     MOVE     70 TO LCONB.
138800     MOVE     SPACES TO SAVESKADATANAME.
138900     OPEN     INPUT SUPPLEMENTAL-PART2-IN.
139000     READ     SUPPLEMENTAL-PART2-IN AT END
139100              DISPLAY XREF003
139200              GO TO WRAPUP.
139300     PERFORM  WRITEHDB THRU HDB-EXIT.
139400     MOVE     ZERO TO Q.
139500     GO       TO ISX.
139600*
139700 READ-SORTER.
139800     READ     SUPPLEMENTAL-PART2-IN AT END
139900              GO TO WRAPUP.
140000*
140100 ISX.
140200     IF       SKADATANAME = SPACES
140300              GO TO READ-SORTER.
140400     PERFORM  PRINTXREF THRU PRINTXREFEXIT.
140500     GO       TO READ-SORTER.
140600*
140700 WRITEHDB.
140800     IF       LCONB < 59
140900              GO TO HDB-EXIT.
141000     ADD      1 TO PGNOB.
141100     MOVE     PGNOB TO PAGE-X.
141200     IF       HDTIME NOT = '00000000'
141300              MOVE HD-HH TO HD2-HH
141400              MOVE HD-MM TO HD2-MM
141500              MOVE HD-SS TO HD2-SS
141600              MOVE HDTIMEB TO H1TIME.
141700     MOVE     SPACES TO PRINTLINE.
141800     WRITE    PRINTLINE FROM HDR1 AFTER TO-TOP-OF-PAGE.
141900     MOVE     1 TO LCONB.
142000     IF       NOT SOURCE-PRINT
142100              WRITE PRINTLINE FROM HDR4 AFTER 2
142200              ADD   2 TO LCONB.
142300     MOVE     SPACES TO PRINTLINE.
142400     WRITE    PRINTLINE AFTER 1.
142500     ADD      1 TO LCONB.
142600*
142700 HDB-EXIT.
142800     EXIT.
142900*
143000 PRINTXREF.
143100     IF       SKADATANAME = SAVESKADATANAME
143200              GO TO CONNECTD.
143300     MOVE     SKADATANAME TO SAVESKADATANAME.
143400*
143500 CHECK-Q.
143600     IF       XRDATANAME NOT = SPACES
143700         AND  Q = ZERO
143800              MOVE 1 TO Q.
143900     IF       Q > ZERO
144000              WRITE PRINTLINE AFTER 1
144100              ADD 1 TO LCONB
144200              MOVE ZERO TO Q
144300              PERFORM WRITEHDB THRU HDB-EXIT
144400              MOVE SPACES TO PRINTLINE.
144500*
144600 CONNECTC.
144700     MOVE     SPACES TO PRINTLINE.
144800     MOVE     SKADATANAME TO XRDATANAME.
144900     MOVE     SKAREFNO TO XRDEFN.
145000     MOVE     LSECT (SKAWSORPD) TO XRTYPE.
145100     GO       TO PRINTXREFEXIT.
145200*
145300 CONNECTD.
145400     IF       Q > 7
145500              PERFORM CHECK-Q.
145600     ADD      1 TO Q.
145700     MOVE     SKAREFNO TO XRREFERENCE (Q).
145800*
145900 PRINTXREFEXIT.
146000     EXIT.
146100*
146200 WRAPUP.
146300     PERFORM  CHECK-Q.
146400     CLOSE    SOURCE-LISTING.
146500     CLOSE    SUPPLEMENTAL-PART2-IN.
146600     IF       PUNCH-SOURCE
146700              DISPLAY 'Created new source file: '.
146800     STOP     RUN.
146900*
146910/
147000 PROCESS-COPY     SECTION.
147100*************************
147200*
147300* We have a copy statement so process it but lets keep it
147400*  as simple as possible.
147500*
147600* To be added only if needed/requested by MVS 3.8j users
147700*


200000*
200100* Common PDS routines from here.
200110*
200120******************************************************************
200130*  THIS IS THE TEST CODE THAT MUST BE CHANGED TO WORK FOR        *
200140*    COBXREF but here to confirm compiler does not complain.     *
200150*^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^*
200160*
200170*  This code will require the assembly and install of BAL routine
200180*    NCZ93205 and the latest version as prev. cannot handle mass
200190*      data
200200*
203700 ZZ000-INITIATE.
203800*
203900     DISPLAY  'NCZ93205 TEST INITIATED'.
204000     PERFORM  ZZ100-OPEN-PDS.
204100     PERFORM  ZZ200-LOCATE-MEMBER-1.
204300     PERFORM  ZZ400-READ-MEMBER.
204400     PERFORM  ZZ500-CLOSE-PDS.
204500
204600     DISPLAY  'NCZ93205 TEST CONCLUDED'.
204700
204800*     STOP     RUN.
204900* =========================================== PROGRAM EXIT POINT
205000
205100 ZZ100-OPEN-PDS.
205300     DISPLAY  'REQUESTING OPEN OF DSN=COPYLIB'.
205400     MOVE     WS-PDS-REQUEST-OPEN TO WS-PDS-REQUEST.
205700     MOVE     'COPYLIB' TO WS-PDS-DDNAME.
205800     PERFORM  ZZ900-CALL-NCZ93205.
205900     IF       RETURN-CODE EQUAL 0
206000              DISPLAY 'OPEN SUCCEEDED (RC=0)'.
206100     IF       RETURN-CODE EQUAL 4
206200              DISPLAY 'OPEN FAILED (RC=4)'.
206300     IF       RETURN-CODE EQUAL 8
206400              DISPLAY 'OPEN FAILED (RC=8); EXECUTION TERMINATED'
206500              STOP RUN.
206600* ------------------------------------------- PERFORM EXIT POINT
206700
206800 ZZ200-LOCATE-MEMBER-1.
208400     DISPLAY 'ATTEMPT TO LOCATE MEMBER=DECTRANS'.
208500     MOVE      WS-PDS-REQUEST-LOCATE TO WS-PDS-REQUEST.
208700     MOVE    'DECTRANS' TO WS-PDS-MEMBER.
208800     PERFORM  ZZ900-CALL-NCZ93205.
208900     IF       RETURN-CODE EQUAL 0
209000              DISPLAY 'MEMBER FOUND (RC=0)'.
209100     IF       RETURN-CODE EQUAL 4
209200              DISPLAY 'MEMBER NOT FOUND (RC=4)'.
209300     IF       RETURN-CODE EQUAL 8
209400              DISPLAY 'LOCATE FAILED (RC=8); EXECUTION TERMINATED'
209500              STOP RUN.
209600* ------------------------------------------- PERFORM EXIT POINT
209700
209800 ZZ400-READ-MEMBER.
210000     DISPLAY  'ATTEMPT TO READ MEMBER=DECTRANS'.
210100     MOVE     WS-PDS-REQUEST-READ TO WS-PDS-REQUEST.
210200     PERFORM  ZZ410-READ-MEMBER
210300              UNTIL RETURN-CODE NOT EQUAL 0.
210400     IF       RETURN-CODE = 4
210500              DISPLAY 'END OF FILE ON MEMBER (RC=4)'.
210600     IF       RETURN-CODE = 8
210700              DISPLAY 'READ FAILED (RC=8); EXECUTION TERMINATED'
210800              STOP RUN.
210900* Just in case
211000     IF       RETURN-CODE > 8
211100              DISPLAY 'READ FAILED (RC>8)'
211200              GOBACK.
211300* ------------------------------------------- PERFORM EXIT POINT
211400
211500 ZZ410-READ-MEMBER.
211600     PERFORM  ZZ900-CALL-NCZ93205.
211700     IF       RETURN-CODE EQUAL 0
211800              DISPLAY 'RECORD: ' WS-PDS-RECORD80.
211900* ------------------------------------------- PERFORM EXIT POINT
212000
212100 ZZ500-CLOSE-PDS.
212200     DISPLAY  'REQUESTING CLOSE'.
212300     MOVE     WS-PDS-REQUEST-CLOSE TO WS-PDS-REQUEST.
212400     PERFORM  ZZ900-CALL-NCZ93205.
212500     IF       RETURN-CODE EQUAL 4
212600              DISPLAY 'CLOSE FAILED (RC=4)'.
212700     IF       RETURN-CODE EQUAL 8
212800              DISPLAY 'CLOSE FAILED (RC=8); EXECUTION TERMINATED'
212900              STOP RUN.
213000* ------------------------------------------- PERFORM EXIT POINT
213100
213200 ZZ900-CALL-NCZ93205.
213300     CALL     'NCZ93205' USING WS-PDS-REQUEST
213400                               WS-PDS-MEMBER
213500                               WS-PDS-RECORD
213600                               WS-PDS-DDNAME.
213700* ------------------------------------------- PERFORM EXIT POINT
213800

250000*
250100* PROCESS THE COPY ???
250200*
