000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COMPTEST.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  A    PIC S9(5)V99 COMP-3 VALUE 100.00.
000600 01  B    PIC S9(5)V99 COMP-3 VALUE 6.00.
000700 01  C    PIC S9(5)    COMP   VALUE 7.
000800 01  R1   PIC 9(7)V99         VALUE 0.
000900 01  R2   PIC 9(7)V99         VALUE 0.
001000 01  R3   PIC 9(7)V99         VALUE 0.
001100 01  R4   PIC 9(7)V99         VALUE 0.
001200 01  R5   PIC 9(7)V99         VALUE 0.
001300 01  R6   PIC 9(7)V99         VALUE 0.
001400 01  R7   PIC 9(7)V99         VALUE 0.
001500 PROCEDURE DIVISION.
001600     COMPUTE R1 = A + B * C.
001700     COMPUTE R2 = ( A + B ) * C.
001800     COMPUTE R3 = A / B.
001900     COMPUTE R4 ROUNDED = A / B.
002000     COMPUTE R5 = - B + A.
002100     COMPUTE R6 = A / C.
002200     COMPUTE R7 ROUNDED = ( A + B ) / C.
002300     DISPLAY R1.
002400     DISPLAY R2.
002500     DISPLAY R3.
002600     DISPLAY R4.
002700     DISPLAY R5.
002800     DISPLAY R6.
002900     DISPLAY R7.
003000     STOP RUN.
