000100* DATE CONVERSION PARAMETER BLOCK -- WRITTEN TO BE COPIED AS
000200*     01  ANY-NAME COPY CPYENT1.
000300* THE ENTRY HEADER BELOW GIVES WAY TO THE COPYING PROGRAM'S.
000400 01  DATECNV-PARM.
000500     05  DC-IN         PIC X(6)  VALUE '092426'.
000600     05  DC-OUT        PIC X(8)  VALUE 'NOT YET'.
