000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EDTEST.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  SRC PIC S9(9)V99 COMP-3 VALUE -1234567.89.
000600 01  E1  PIC ----,---,--9.99.
000700 01  E2  PIC ZZZ,ZZ9.99.
000800 01  E3  PIC +99999.
000900 01  E4  PIC ***,**9.99.
001000 01  E5  PIC ---,---,--9.
001100 PROCEDURE DIVISION.
001200 MAIN-PARA.
001300     MOVE SRC TO E1.
001400     DISPLAY E1.
001500     MOVE 1234.56 TO E2.
001600     DISPLAY E2.
001700     MOVE 42 TO E3.
001800     DISPLAY E3.
001900     MOVE 1234.56 TO E4.
002000     DISPLAY E4.
002100     MOVE -98765 TO E5.
002200     DISPLAY E5.
002300     STOP RUN.
