000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. FILETEST.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT IN-FILE  ASSIGN TO UT-S-INFILE.
000700     SELECT OUT-FILE ASSIGN TO UT-S-OUTFILE.
000800 DATA DIVISION.
000900 FILE SECTION.
001000 FD  IN-FILE
001100     LABEL RECORDS ARE OMITTED.
001200 01  IN-REC          PIC X(80).
001300 FD  OUT-FILE
001400     LABEL RECORDS ARE OMITTED.
001500 01  OUT-REC         PIC X(80).
001600 WORKING-STORAGE SECTION.
001700 01  REC-COUNT       PIC S9(5) COMP VALUE 0.
001800 01  OUT-NUM         PIC 9(5)       VALUE 0.
001900 PROCEDURE DIVISION.
002000 MAIN-PARA.
002100     OPEN INPUT IN-FILE OUTPUT OUT-FILE.
002200     PERFORM READ-PARA THRU READ-EXIT.
002300     CLOSE IN-FILE OUT-FILE.
002400     MOVE REC-COUNT TO OUT-NUM.
002500     DISPLAY OUT-NUM.
002600     STOP RUN.
002700 READ-PARA.
002800     READ IN-FILE AT END GO TO READ-EXIT.
002900     ADD 1 TO REC-COUNT.
003000     MOVE IN-REC TO OUT-REC.
003100     WRITE OUT-REC.
003200     GO TO READ-PARA.
003300 READ-EXIT.
003400     EXIT.
