000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. GIVING.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  A PIC S9(8) COMP VALUE 100.
000600 01  B PIC S9(8) COMP VALUE 7.
000700 01  C PIC S9(8) COMP VALUE 0.
000800 01  S PIC 9(8) VALUE 0.
000900 PROCEDURE DIVISION.
001000 MAIN-PARA.
001100     ADD 1 A GIVING C.
001200     MOVE C TO S. DISPLAY 'ADD2   ' S.
001300     ADD A TO B GIVING C.
001400     MOVE C TO S. DISPLAY 'ADDTO  ' S.
001500     SUBTRACT 1 FROM A GIVING C.
001600     MOVE C TO S. DISPLAY 'SUB    ' S.
001700     SUBTRACT B FROM A GIVING C.
001800     MOVE C TO S. DISPLAY 'SUBVAR ' S.
001900     MULTIPLY A BY B GIVING C.
002000     MOVE C TO S. DISPLAY 'MULT   ' S.
002100     DIVIDE B INTO A GIVING C.
002200     MOVE C TO S. DISPLAY 'DIVINTO' S.
002300     DIVIDE A BY B GIVING C.
002400     MOVE C TO S. DISPLAY 'DIVBY  ' S.
002500     ADD 1 A B GIVING C.
002600     MOVE C TO S. DISPLAY 'ADD3   ' S.
002700     STOP RUN.
