000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. GODEP10.
000300* GO TO ... DEPENDING ON with ten procedure-names, and values that
000400* fall through: below one and past the last.
000500 ENVIRONMENT DIVISION.
000600 DATA DIVISION.
000700 WORKING-STORAGE SECTION.
000800 01  SEL       PIC S9(4) COMP.
000900 01  VALS.
001000     05  FILLER PIC X(10) VALUE '0103091011'.
001100 01  VTAB REDEFINES VALS.
001200     05  V     PIC 99 OCCURS 5 TIMES.
001300 01  I         PIC 9.
001400 PROCEDURE DIVISION.
001500 MAIN-PARA.
001600     PERFORM TRY-ONE VARYING I FROM 1 BY 1 UNTIL I > 5.
001700     MOVE -1 TO SEL.
001800     PERFORM DISPATCH THRU DISPATCH-EXIT.
001900     STOP RUN.
002000 TRY-ONE.
002100     MOVE V (I) TO SEL.
002200     PERFORM DISPATCH THRU DISPATCH-EXIT.
002300 DISPATCH.
002400     GO TO P1 P2 P3 P4 P5 P6 P7 P8 P9 P10
002500         DEPENDING ON SEL.
002600     DISPLAY 'FELL THROUGH ' SEL.
002700     GO TO DISPATCH-EXIT.
002800 P1.
002900     DISPLAY 'LANDED IN P1'.
003000     GO TO DISPATCH-EXIT.
003100 P2.
003200     DISPLAY 'LANDED IN P2'.
003300     GO TO DISPATCH-EXIT.
003400 P3.
003500     DISPLAY 'LANDED IN P3'.
003600     GO TO DISPATCH-EXIT.
003700 P4.
003800     DISPLAY 'LANDED IN P4'.
003900     GO TO DISPATCH-EXIT.
004000 P5.
004100     DISPLAY 'LANDED IN P5'.
004200     GO TO DISPATCH-EXIT.
004300 P6.
004400     DISPLAY 'LANDED IN P6'.
004500     GO TO DISPATCH-EXIT.
004600 P7.
004700     DISPLAY 'LANDED IN P7'.
004800     GO TO DISPATCH-EXIT.
004900 P8.
005000     DISPLAY 'LANDED IN P8'.
005100     GO TO DISPATCH-EXIT.
005200 P9.
005300     DISPLAY 'LANDED IN P9'.
005400     GO TO DISPATCH-EXIT.
005500 P10.
005600     DISPLAY 'LANDED IN P10'.
005700     GO TO DISPATCH-EXIT.
005800 DISPATCH-EXIT.
005900     EXIT.
