000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. GODEP.
000300* GO TO ... DEPENDING ON is Nucleus level 1: the value 1 selects the
000400* first procedure-name, 2 the second, and anything outside the series
000500* falls through to the next statement. Both edges are exercised.
000600 DATA DIVISION.
000700 WORKING-STORAGE SECTION.
000800 01  SEL          PIC 9     VALUE 0.
000900 01  SELC         PIC S9(4) COMP VALUE 0.
001000 01  TAB.
001100     05  TV       PIC 99 OCCURS 3 TIMES.
001200 PROCEDURE DIVISION.
001300 MAIN.
001400     MOVE 0 TO SEL.
001500     PERFORM TRY THRU TRY-X.
001600     MOVE 1 TO SEL.
001700     PERFORM TRY THRU TRY-X.
001800     MOVE 2 TO SEL.
001900     PERFORM TRY THRU TRY-X.
002000     MOVE 3 TO SEL.
002100     PERFORM TRY THRU TRY-X.
002200     MOVE 4 TO SEL.
002300     PERFORM TRY THRU TRY-X.
002400     MOVE 2 TO SELC.
002500     PERFORM TRYC THRU TRYC-X.
002600     MOVE 1 TO TV (1).
002700     MOVE 3 TO TV (2).
002800     PERFORM TRYT THRU TRYT-X.
002900     STOP RUN.
003000 TRY.
003100     GO TO ONE TWO THREE DEPENDING ON SEL.
003200     DISPLAY 'FELL THROUGH FOR ' SEL.
003300     GO TO TRY-X.
003400 ONE.
003500     DISPLAY 'ONE FOR ' SEL.
003600     GO TO TRY-X.
003700 TWO.
003800     DISPLAY 'TWO FOR ' SEL.
003900     GO TO TRY-X.
004000 THREE.
004100     DISPLAY 'THREE FOR ' SEL.
004200 TRY-X.
004300     EXIT.
004400 TRYC.
004500     GO TO C-ONE C-TWO DEPENDING ON SELC.
004600     DISPLAY 'COMP FELL THROUGH'.
004700     GO TO TRYC-X.
004800 C-ONE.
004900     DISPLAY 'COMP ONE'.
005000     GO TO TRYC-X.
005100 C-TWO.
005200     DISPLAY 'COMP TWO'.
005300 TRYC-X.
005400     EXIT.
005500 TRYT.
005600     GO TO T-ONE T-TWO T-THREE DEPENDING ON TV (2).
005700     DISPLAY 'TABLE FELL THROUGH'.
005800     GO TO TRYT-X.
005900 T-ONE.
006000     DISPLAY 'TABLE ONE'.
006100     GO TO TRYT-X.
006200 T-TWO.
006300     DISPLAY 'TABLE TWO'.
006400     GO TO TRYT-X.
006500 T-THREE.
006600     DISPLAY 'TABLE THREE'.
006700 TRYT-X.
006800     EXIT.
