000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. GUSAGE.
000300* USAGE on a group is inherited by elementary items that have none.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01  G USAGE COMP-3.
000700     05  A PIC 9(5) VALUE 0.
000800     05  B PIC S9(3)V99 VALUE 0.
000900 01  SHOW PIC 9(5).
001000 01  SHOWB PIC 999.99.
001100 PROCEDURE DIVISION.
001200     ADD 1 TO A.
001300     ADD 2.50 TO B.
001400     MOVE A TO SHOW.
001500     MOVE B TO SHOWB.
001600     DISPLAY SHOW ' ' SHOWB.
001700     STOP RUN.
