000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 PROCEDURE DIVISION.
000600     DISPLAY 'HELLO FROM COBC. NO SYS1.COBLIB HERE.'.
000700     DISPLAY 'SECOND LINE, WITH A QUOTE: DON''T PANIC.'.
000800     STOP RUN.
