000100 ID DIVISION.
000200 PROGRAM-ID. IDTEST.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 PROCEDURE DIVISION.
000600     DISPLAY 'ID DIVISION ABBREVIATION ACCEPTED'.
000700     STOP RUN.
