000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. INTOFROM.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT IN-FILE  ASSIGN TO UT-S-INFILE.
000700     SELECT OUT-FILE ASSIGN TO UT-S-OUTFILE.
000800 DATA DIVISION.
000900 FILE SECTION.
001000 FD  IN-FILE
001100     LABEL RECORDS ARE OMITTED.
001200 01  IN-REC   PIC X(80).
001300 FD  OUT-FILE
001400     LABEL RECORDS ARE OMITTED.
001500 01  OUT-REC  PIC X(80).
001600 WORKING-STORAGE SECTION.
001700 01  WS-BUF.
001800     05  WS-TAG   PIC X(6).
001900     05  WS-REST  PIC X(74).
002000 01  WS-OUT.
002100     05  WO-MARK  PIC X(3)  VALUE '>> '.
002200     05  WO-TAG   PIC X(6)  VALUE SPACES.
002300     05  FILLER   PIC X(71) VALUE SPACES.
002400 01  CNT   PIC S9(5) COMP VALUE 0.
002500 01  SHOW  PIC 9(5)  VALUE 0.
002600 PROCEDURE DIVISION.
002700 MAIN-PARA.
002800     OPEN INPUT IN-FILE OUTPUT OUT-FILE.
002900     PERFORM READ-PARA THRU READ-EXIT.
003000     CLOSE IN-FILE OUT-FILE.
003100     MOVE CNT TO SHOW.
003200     DISPLAY 'COUNT ' SHOW.
003300*    WS-BUF must still hold the LAST record, not be cleared by AT END
003400     DISPLAY 'LAST [' WS-TAG ']'.
003500     STOP RUN.
003600 READ-PARA.
003700     READ IN-FILE INTO WS-BUF AT END GO TO READ-EXIT.
003800     ADD 1 TO CNT.
003900     DISPLAY 'GOT [' WS-TAG ']'.
004000     MOVE WS-TAG TO WO-TAG.
004100     WRITE OUT-REC FROM WS-OUT.
004200     GO TO READ-PARA.
004300 READ-EXIT.
004400     EXIT.
