000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ISAMRD2.
000300*    READ BACK THE ISAM FILE THAT ISAMLOAD CREATED.
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT DESCIDX ASSIGN TO DA-I-DESCIDX
000800         ACCESS IS SEQUENTIAL
000900         RECORD KEY IS DESC-KEY.
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD  DESCIDX
001300     LABEL RECORDS ARE STANDARD
001400     RECORD CONTAINS 81 CHARACTERS.
001500 01  DESC-RECORD.
001600     05  DESC-DELETE     PIC X.
001700     05  DESC-KEY        PIC 9(10).
001800     05  DESC-TEXT       PIC X(70).
001900 WORKING-STORAGE SECTION.
002000 01  OUT-KEY PIC 9(10) VALUE 0.
002100 PROCEDURE DIVISION.
002200 A001-READ.
002300     OPEN INPUT DESCIDX.
002400 A002-LOOP.
002500     READ DESCIDX AT END GO TO A003-DONE.
002600     MOVE DESC-KEY TO OUT-KEY.
002700     DISPLAY 'BACK ' OUT-KEY ' ' DESC-TEXT.
002800     GO TO A002-LOOP.
002900 A003-DONE.
003000     CLOSE DESCIDX.
003100     GOBACK.
