000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ISAMLOAD.
000300*    LOAD AN ISAM FILE IN ASCENDING KEY ORDER (QISAM LOAD MODE).
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT DESCIDX ASSIGN TO DA-I-DESCIDX
000800         ACCESS IS SEQUENTIAL
000900         RECORD KEY IS DESC-KEY.
001000     SELECT DESCIN ASSIGN TO UT-S-DESCIN.
001100 DATA DIVISION.
001200 FILE SECTION.
001300 FD  DESCIDX
001400     BLOCK CONTAINS 10 RECORDS
001500     LABEL RECORDS ARE STANDARD
001600     RECORD CONTAINS 81 CHARACTERS.
001700 01  DESC-RECORD.
001800     05  DESC-DELETE     PIC X.
001900     05  DESC-KEY        PIC 9(10).
002000     05  DESC-TEXT       PIC X(70).
002100 FD  DESCIN
002200     LABEL RECORDS ARE OMITTED
002300     RECORD CONTAINS 80 CHARACTERS.
002400 01  INPUT-RECORD.
002500     05  IN-KEY          PIC 9(10).
002600     05  IN-TEXT         PIC X(70).
002700 WORKING-STORAGE SECTION.
002800 01  WS-EOF-FLAG PIC X VALUE 'N'.
002900     88  EOF VALUE 'Y'.
003000 01  WS-CNT      PIC S9(4) COMP VALUE 0.
003100 PROCEDURE DIVISION.
003200 A001-LOAD.
003300     OPEN INPUT DESCIN.
003400     OPEN OUTPUT DESCIDX.
003500     PERFORM A002-READ THRU A002-READ-END.
003600     PERFORM A003-PROCESS UNTIL EOF.
003700     CLOSE DESCIN DESCIDX.
003800     DISPLAY 'DESCIDX LOADED.'.
003900     GOBACK.
004000 A002-READ.
004100     READ DESCIN
004200         AT END
004300             MOVE 'Y' TO WS-EOF-FLAG.
004400 A002-READ-END.
004500     EXIT.
004600 A003-PROCESS.
004800     MOVE IN-KEY TO DESC-KEY.
004900     MOVE IN-TEXT TO DESC-TEXT.
005000     WRITE DESC-RECORD
005100         INVALID KEY
005200             DISPLAY 'DUPLICATE OR SEQ-ERR'
005300             DISPLAY DESC-KEY.
005400     ADD 1 TO WS-CNT.
005500     PERFORM A002-READ THRU A002-READ-END.
