000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ISAMRNF.
000300*    BISAM RANDOM READ FILE STATUS: 00 WHEN FOUND, 23 WHEN NOT.
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT DESCIDX ASSIGN TO DA-I-DESCIDX
000800         ACCESS IS RANDOM
000900         RECORD KEY IS DESC-KEY
001000         NOMINAL KEY IS WS-NOMKEY
001100         FILE STATUS IS WS-ST.
001200 DATA DIVISION.
001300 FILE SECTION.
001400 FD  DESCIDX
001500     LABEL RECORDS ARE STANDARD
001600     RECORD CONTAINS 81 CHARACTERS.
001700 01  DESC-RECORD.
001800     05  DESC-DELETE     PIC X.
001900     05  DESC-KEY        PIC 9(10).
002000     05  DESC-TEXT       PIC X(70).
002100 WORKING-STORAGE SECTION.
002200 01  WS-NOMKEY PIC 9(10) VALUE 0.
002300 01  WS-ST PIC XX.
002400 PROCEDURE DIVISION.
002500 A001-READ.
002600     OPEN INPUT DESCIDX.
002700     MOVE 200 TO WS-NOMKEY.
002800     READ DESCIDX INVALID KEY DISPLAY 'IK1 ' WS-ST.
002900     DISPLAY 'R1 ' WS-ST.
003000     MOVE 555 TO WS-NOMKEY.
003100     READ DESCIDX INVALID KEY DISPLAY 'IK2 ' WS-ST.
003200     DISPLAY 'R2 ' WS-ST.
003300     MOVE 300 TO WS-NOMKEY.
003400     READ DESCIDX INVALID KEY DISPLAY 'IK3 ' WS-ST.
003500     DISPLAY 'R3 ' WS-ST ' ' DESC-TEXT.
003600     CLOSE DESCIDX.
003700     GOBACK.
