000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. LINK1ST.
000300* LINKAGE SECTION first in the DATA DIVISION, no WORKING-STORAGE.
000400 DATA DIVISION.
000500 LINKAGE SECTION.
000600 01  LS-X PIC X.
000700 PROCEDURE DIVISION USING LS-X.
000800     GOBACK.
