000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. LITMOVE.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  TS-CC   PIC 99.
000600 01  WIDE    PIC 9(5).
000700 PROCEDURE DIVISION.
000800 A.
000900     MOVE '20' TO TS-CC.
001000     DISPLAY 'CC=[' TS-CC ']'.
001100     MOVE '20' TO WIDE.
001200     DISPLAY 'WIDE=[' WIDE ']'.
001300     STOP RUN.
