000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MERGEMT.
000300* MERGE with files that have no records: one of three empty, then
000400* every file empty, when the output procedure's first RETURN
000500* takes AT END. The program writes the files itself. Expected
000600* output is the 1974 standard's rule, worked by hand.
000700 ENVIRONMENT DIVISION.
000800 INPUT-OUTPUT SECTION.
000900 FILE-CONTROL.
001000     SELECT E1 ASSIGN TO UT-S-MRGIN1.
001100     SELECT E2 ASSIGN TO UT-S-MRGIN2.
001200     SELECT E3 ASSIGN TO UT-S-MRGIN3.
001300     SELECT OUT-FILE ASSIGN TO UT-S-OUTFILE.
001400     SELECT MERGE-FILE ASSIGN TO UT-S-SORTWK01.
001500 DATA DIVISION.
001600 FILE SECTION.
001700 FD  E1 LABEL RECORDS ARE STANDARD.
001800 01  E1-REC PIC X(10).
001900 FD  E2 LABEL RECORDS ARE STANDARD.
002000 01  E2-REC PIC X(10).
002100 FD  E3 LABEL RECORDS ARE STANDARD.
002200 01  E3-REC PIC X(10).
002300 FD  OUT-FILE LABEL RECORDS ARE STANDARD.
002400 01  OUT-REC PIC X(10).
002500 SD  MERGE-FILE.
002600 01  M-REC.
002700     05  M-KEY    PIC X(5).
002800     05  M-REST   PIC X(5).
002900 WORKING-STORAGE SECTION.
003000 01  EOF PIC X VALUE 'N'.
003100 01  CNT PIC 99 VALUE 0.
003200 01  SR  PIC S9(4).
003300 PROCEDURE DIVISION.
003400 MAIN-PARA.
003500     OPEN OUTPUT E1 E2 E3.
003600     MOVE 'KEY02 F2' TO E2-REC.
003700     WRITE E2-REC.
003800     MOVE 'KEY05 F2' TO E2-REC.
003900     WRITE E2-REC.
004000     CLOSE E1 E2 E3.
004100     MERGE MERGE-FILE ASCENDING KEY M-KEY
004200         USING E1 E2 E3 GIVING OUT-FILE.
004300     MOVE SORT-RETURN TO SR.
004400     DISPLAY 'FIRST MERGE SORT-RETURN ' SR.
004500     OPEN INPUT OUT-FILE.
004600     READ OUT-FILE AT END MOVE 'Y' TO EOF.
004700     PERFORM SHOW-ONE UNTIL EOF = 'Y'.
004800     CLOSE OUT-FILE.
004900     MERGE MERGE-FILE ASCENDING KEY M-KEY
005000         USING E1 E3 OUTPUT PROCEDURE IS COUNT-IT.
005100     DISPLAY 'SECOND MERGE RETURNED ' CNT.
005200     STOP RUN.
005300 SHOW-ONE.
005400     DISPLAY OUT-REC.
005500     READ OUT-FILE AT END MOVE 'Y' TO EOF.
005600 COUNT-IT SECTION.
005700 C1.
005800     RETURN MERGE-FILE AT END
005900         DISPLAY 'AT END ON RETURN ' CNT
006000         GO TO C-EXIT.
006100     ADD 1 TO CNT.
006200     GO TO C1.
006300 C-EXIT.
006400     EXIT.
