000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MERGE3.
000300* MERGE of three files on keys of the sort's other formats:
000400* COMP-3 ascending, COMP descending, signed DISPLAY ascending,
000500* negative values in each. The program writes the three files
000600* first, each in order, then merges them with an OUTPUT PROCEDURE
000700* and RETURN INTO ... AT END -- twice over, since a MERGE opens
000800* and closes its files. Ties on every key come out in USING
000900* order. Expected output is the 1974 standard's rule, worked by
001000* hand.
001100 ENVIRONMENT DIVISION.
001200 INPUT-OUTPUT SECTION.
001300 FILE-CONTROL.
001400     SELECT F1 ASSIGN TO UT-S-MRGIN1.
001500     SELECT F2 ASSIGN TO UT-S-MRGIN2.
001600     SELECT F3 ASSIGN TO UT-S-MRGIN3.
001700     SELECT MERGE-FILE ASSIGN TO UT-S-SORTWK01.
001800 DATA DIVISION.
001900 FILE SECTION.
002000 FD  F1 LABEL RECORDS ARE STANDARD.
002100 01  F1-REC PIC X(20).
002200 FD  F2 LABEL RECORDS ARE STANDARD.
002300 01  F2-REC PIC X(20).
002400 FD  F3 LABEL RECORDS ARE STANDARD.
002500 01  F3-REC PIC X(20).
002600 SD  MERGE-FILE.
002700 01  M-REC.
002800     05  M-PD     PIC S9(5) COMP-3.
002900     05  M-BI     PIC S9(4) COMP.
003000     05  M-ZD     PIC S9(3).
003100     05  M-TAG    PIC X(4).
003200     05  FILLER   PIC X(8).
003300 WORKING-STORAGE SECTION.
003400 01  I       PIC 99.
003500 01  PASS    PIC 9 VALUE 0.
003600 01  CNT     PIC 99.
003700 01  W-REC.
003800     05  W-PD     PIC S9(5) COMP-3.
003900     05  W-BI     PIC S9(4) COMP.
004000     05  W-ZD     PIC S9(3).
004100     05  W-TAG    PIC X(4).
004200     05  FILLER   PIC X(8) VALUE SPACES.
004300 01  D-PD  PIC -(5)9.
004400 01  D-BI  PIC -(4)9.
004500 01  D-ZD  PIC -(3)9.
004600 01  TABV.
004700     05  FILLER PIC X(19) VALUE 'F1-A-00500+0010-001'.
004800     05  FILLER PIC X(19) VALUE 'F1-B-00500+0010+005'.
004900     05  FILLER PIC X(19) VALUE 'F1-C+00000+0003+000'.
005000     05  FILLER PIC X(19) VALUE 'F1-D+00250+0003-020'.
005100     05  FILLER PIC X(19) VALUE 'F2-A-00500+0020+000'.
005200     05  FILLER PIC X(19) VALUE 'F2-B-00500+0010+005'.
005300     05  FILLER PIC X(19) VALUE 'F2-C+00250+0003-020'.
005400     05  FILLER PIC X(19) VALUE 'F2-D+99999-0001+999'.
005500     05  FILLER PIC X(19) VALUE 'F3-A-99999+0000+000'.
005600     05  FILLER PIC X(19) VALUE 'F3-B+00000+0007-007'.
005700     05  FILLER PIC X(19) VALUE 'F3-C+00000+0003+000'.
005800     05  FILLER PIC X(19) VALUE 'F3-D+00250-0002+000'.
005900 01  TAB REDEFINES TABV.
006000     05  T OCCURS 12 TIMES.
006100         10  T-TAG  PIC X(4).
006200         10  T-PS   PIC X.
006300         10  T-PD   PIC 9(5).
006400         10  T-BS   PIC X.
006500         10  T-BI   PIC 9(4).
006600         10  T-ZS   PIC X.
006700         10  T-ZD   PIC 999.
006800 PROCEDURE DIVISION.
006900 MAIN-PARA.
007000     OPEN OUTPUT F1 F2 F3.
007100     PERFORM LOAD-ONE VARYING I FROM 1 BY 1 UNTIL I > 12.
007200     CLOSE F1 F2 F3.
007300     PERFORM MERGE-IT.
007400     PERFORM MERGE-IT.
007500     STOP RUN.
007600 MERGE-IT.
007700     ADD 1 TO PASS.
007800     MOVE 0 TO CNT.
007900     DISPLAY 'PASS ' PASS.
008000     MERGE MERGE-FILE ASCENDING KEY M-PD DESCENDING KEY M-BI
008100         ASCENDING KEY M-ZD
008200         USING F1 F2 F3 OUTPUT PROCEDURE IS SHOW-IT.
008300     MOVE SORT-RETURN TO D-BI.
008400     DISPLAY 'RETURNED ' CNT ' SORT-RETURN ' D-BI.
008500 LOAD-ONE.
008600     MOVE T-TAG (I) TO W-TAG.
008700     MOVE T-PD (I) TO W-PD.
008800     IF T-PS (I) = '-' COMPUTE W-PD = 0 - W-PD.
008900     MOVE T-BI (I) TO W-BI.
009000     IF T-BS (I) = '-' COMPUTE W-BI = 0 - W-BI.
009100     MOVE T-ZD (I) TO W-ZD.
009200     IF T-ZS (I) = '-' COMPUTE W-ZD = 0 - W-ZD.
009300     IF I < 5 WRITE F1-REC FROM W-REC
009400     ELSE IF I < 9 WRITE F2-REC FROM W-REC
009500     ELSE WRITE F3-REC FROM W-REC.
009600 SHOW-IT SECTION.
009700 S1.
009800     RETURN MERGE-FILE INTO W-REC AT END GO TO S-EXIT.
009900     ADD 1 TO CNT.
010000     MOVE W-PD TO D-PD.
010100     MOVE W-BI TO D-BI.
010200     MOVE W-ZD TO D-ZD.
010300     DISPLAY W-TAG ' ' D-PD ' ' D-BI ' ' D-ZD.
010400     GO TO S1.
010500 S-EXIT.
010600     EXIT.
