000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MISC2.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01  A PIC S9(5) COMP VALUE 99.
000700 01  B PIC S9(5) COMP VALUE 99.
000800 01  C PIC S9(5) COMP VALUE 99.
000900 01  SA PIC 9(5) VALUE 0.
001000 01  SB PIC 9(5) VALUE 0.
001100 01  SC PIC 9(5) VALUE 0.
001200 01  GRP.
001300     05  G1 PIC X(3) VALUE 'ABC'.
001400     05  G2 PIC X(3) VALUE 'DEF'.
001500 01  SGN PIC S9(5) VALUE 12345.
001600 01  TXT PIC X(4) VALUE '2026'.
001700 01  NUM PIC 9(4) VALUE 0.
001800 01  NUM6 PIC 9(6) VALUE 0.
001900 01  PARM-BLK SYNC.
002000     05  PB-LEN  PIC S9(4) COMP.
002100     05  PB-VAL  PIC X(4).
002200 PROCEDURE DIVISION.
002300 MAIN-PARA.
002400*    one source, several receiving fields
002500     MOVE +7 TO A B C.
002600     MOVE A TO SA. MOVE B TO SB. MOVE C TO SC.
002700     DISPLAY 'MULTI ' SA ' ' SB ' ' SC.
002800*    DISPLAY of a group
002900     DISPLAY 'GROUP [' GRP ']'.
003000*    DISPLAY of a signed DISPLAY item shows the overpunch
003100     DISPLAY 'SIGNED [' SGN ']'.
003200*    alphanumeric into an unsigned numeric, same width and wider
003300     MOVE TXT TO NUM.
003400     DISPLAY 'NUM  [' NUM ']'.
003500     MOVE TXT TO NUM6.
003600     DISPLAY 'NUM6 [' NUM6 ']'.
003700     STOP RUN.
