000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MOVELIT.
000300* A 40-character nonnumeric MOVE used to overflow immdigits[34].
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01  F PIC X(40).
000700 PROCEDURE DIVISION.
000800     MOVE 'BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB' TO F.
000900     DISPLAY F.
001000     STOP RUN.
