000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. NEXTSENT.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  A PIC 9 VALUE 1.
000600 01  B PIC 9 VALUE 0.
000700 PROCEDURE DIVISION.
000800     IF A = 1
000900         NEXT SENTENCE
001000     ELSE
001100         MOVE 1 TO B.
001200     DISPLAY B.
001300     STOP RUN.
