000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. OCCMIN.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  T.
000600     05  TE OCCURS 5 TIMES.
000700         10  TA  PIC S9(7)V99 COMP-3.
000800         10  TB  PIC S9(7)V99 COMP-3.
000900 01  IDX      PIC S9(4) COMP VALUE 3.
001000 01  OUT-NUM  PIC 9(7)V99    VALUE 0.
001100 PROCEDURE DIVISION.
001200 MAIN-PARA.
001300     MOVE 700 TO TA (IDX).
001400     MOVE TA (IDX) TO OUT-NUM.
001500     DISPLAY OUT-NUM.
001600     STOP RUN.
