000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PGMCHK.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  W.
000600     02  W-A                 PIC X(3)  VALUE 'ABC'.
000700     02  W-N REDEFINES W-A   PIC S9(5) COMP-3.
000800 01  RESULT-FIELD            PIC S9(7) VALUE +0.
000900 PROCEDURE DIVISION.
001000 000-MAIN.
001100     DISPLAY 'BEFORE THE BAD ADD'.
001200     ADD W-N TO RESULT-FIELD.
001300     DISPLAY 'AFTER THE BAD ADD'.
001400     STOP RUN.
