000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. RENAMES.
000300* Level-66 RENAMES (II-29): another name for a range of a record's
000400* storage, elementary when it renames one elementary item and a
000500* group otherwise; and GO TO with no procedure-name, legal only
000550* in a
000600* paragraph an ALTER names.
000700 DATA DIVISION.
000800 WORKING-STORAGE SECTION.
000900 01  REC.
001000     05  A            PIC X(3)  VALUE 'AAA'.
001100     05  B            PIC 9(3)  VALUE 123.
001200     05  C            PIC X(2)  VALUE 'CC'.
001300     05  D.
001400         10  D1       PIC X(2)  VALUE 'D1'.
001500         10  D2       PIC X(2)  VALUE 'D2'.
001600     05  E            PIC X(1)  VALUE 'E'.
001700 66  BC  RENAMES B THRU C.
001800 66  BB  RENAMES B.
001900 66  DD  RENAMES D.
002000 66  CDE RENAMES C THRU E.
002100 01  N            PIC 9(3).
002200 PROCEDURE DIVISION.
002300 MAIN.
002400     DISPLAY '[' BC '][' BB ']'.
002450     DISPLAY '[' DD '][' CDE ']'.
002500     ADD 1 TO BB.
002600     MOVE BB TO N.
002700     DISPLAY '[' B '][' N ']'.
002800     MOVE 'XYZWV' TO BC.
002900     DISPLAY '[' REC ']'.
003000     MOVE 'QQ' TO DD.
003100     IF CDE = 'YZQQ E' DISPLAY 'CDE OK'
003150         ELSE DISPLAY 'CDE [' CDE ']'.
003200     ALTER SWITCH TO PROCEED TO SECOND-P.
003300     GO TO SWITCH.
003400 FIRST-P.
003500     DISPLAY 'FIRST-P'.
003600     GO TO DONE.
003700 SECOND-P.
003800     DISPLAY 'SECOND-P'.
003900     ALTER SWITCH TO PROCEED TO FIRST-P.
004000     GO TO SWITCH.
004100 SWITCH.
004200     GO TO.
004300 DONE.
004400     STOP RUN.
