000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. RETCODE.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 PROCEDURE DIVISION.
000600     DISPLAY 'SETTING RETURN-CODE TO 8'.
000700     MOVE 8 TO RETURN-CODE.
000800     STOP RUN.
