000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SAMEREC.
000300* SAME RECORD AREA: the two files' records are one area. VALUE
000400* ZERO on alphanumerics is the character 0 throughout. TIME-OF-
000500* DAY is HHMMSS, six digits. A DISPLAY of more than eight
000600* operands is one line. Expected output recorded from IBM ANS
000700* COBOL on TK5.
000800 ENVIRONMENT DIVISION.
000900 INPUT-OUTPUT SECTION.
001000 FILE-CONTROL.
001100     SELECT F1 ASSIGN TO UT-S-OUTFILE.
001200     SELECT F2 ASSIGN TO UT-S-OUTFILE.
001300 I-O-CONTROL.
001400     SAME RECORD AREA FOR F1 F2.
001500 DATA DIVISION.
001600 FILE SECTION.
001700 FD  F1 LABEL RECORDS ARE STANDARD.
001800 01  R1.
001900     05  R1-A PIC X(5).
002000     05  R1-B PIC X(75).
002100 FD  F2 LABEL RECORDS ARE STANDARD.
002200 01  R2.
002300     05  R2-A PIC X(3).
002400     05  R2-B PIC X(77).
002500 WORKING-STORAGE SECTION.
002600 01  Z1  PIC XX VALUE ZEROS.
002700 01  Z2  PIC X(4) VALUE ZERO.
002800 01  Z3  PIC X(3) VALUE ZEROES.
002900 01  TOD  PIC X(8) VALUE ALL '*'.
003000 01  TOD-PARTS REDEFINES TOD.
003100     05  TOD-HH PIC 99.
003200     05  TOD-MM PIC 99.
003300     05  TOD-SS PIC 99.
003400     05  TOD-REST PIC XX.
003500 01  TOD6 PIC 9(6).
003600 PROCEDURE DIVISION.
003700     DISPLAY 'Z [' Z1 '][' Z2 '][' Z3 ']'.
003800     MOVE TIME-OF-DAY TO TOD.
003900     IF TOD-HH NUMERIC AND TOD-MM NUMERIC AND TOD-SS NUMERIC
004000         AND TOD-HH < 24 AND TOD-MM < 60 AND TOD-SS < 60
004100         DISPLAY 'TIME-OF-DAY IS HHMMSS'
004200     ELSE DISPLAY 'TIME-OF-DAY [' TOD ']'.
004300     DISPLAY 'AFTER THE SIX [' TOD-REST ']'.
004400     MOVE TIME-OF-DAY TO TOD6.
004500     IF TOD6 NUMERIC DISPLAY 'TIME-OF-DAY IS NUMERIC'.
004600     MOVE ALL 'X' TO R1.
004700     MOVE 'HELLO' TO R1-A.
004800     DISPLAY 'SAME [' R2-A '][' R1-A ']'.
004900     MOVE 'ABC' TO R2-A.
005000     DISPLAY 'SAME [' R1-A '] ' 'ONE' ' TWO' ' THREE' ' FOUR'
005100         ' FIVE' ' SIX' ' SEVEN' ' EIGHT' ' NINE' ' TEN'.
005200     STOP RUN.
