000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SORTPROC.
000300* SORT with INPUT and OUTPUT PROCEDUREs: RELEASE, RELEASE FROM,
000400* and RETURN INTO ... AT END, run as coroutines with the sort
000500* through its E15 and E35 exits. Keys of all four formats -- ZD,
000600* PD, FI, ZD again -- in both directions, with ties that fall
000700* through to later keys. The DISPLAY of nine operands is one
000800* line, as IBM prints it. Expected output recorded from IBM ANS
000900* COBOL on TK5.
001000 ENVIRONMENT DIVISION.
001100 INPUT-OUTPUT SECTION.
001200 FILE-CONTROL.
001300     SELECT SORT-FILE ASSIGN TO UT-S-SORTWK01.
001400 DATA DIVISION.
001500 FILE SECTION.
001600 SD  SORT-FILE.
001700 01  S-REC.
001800     05  S-TAG    PIC X(4).
001900     05  S-ZD     PIC S9(3).
002000     05  S-PD     PIC S9(3) COMP-3.
002100     05  S-BI     PIC S9(4) COMP.
002200     05  S-UZ     PIC 9(3).
002300     05  FILLER   PIC X(26).
002400 WORKING-STORAGE SECTION.
002500 01  I       PIC 99.
002600 01  W-REC.
002700     05  W-TAG    PIC X(4).
002800     05  W-ZD     PIC S9(3).
002900     05  W-PD     PIC S9(3) COMP-3.
003000     05  W-BI     PIC S9(4) COMP.
003100     05  W-UZ     PIC 9(3).
003200     05  FILLER   PIC X(26).
003300 01  TABV.
003400     05  FILLER PIC X(30) VALUE 'R01 +005-003+0007001R02 -005+0'.
003500     05  FILLER PIC X(30) VALUE '02-0001002R03 +005-003-0009003'.
003600     05  FILLER PIC X(30) VALUE 'R04 +000+001+0001004R05 +005+0'.
003700     05  FILLER PIC X(30) VALUE '04+0000005R06 -005+002-0001009'.
003800     05  FILLER PIC X(30) VALUE 'R07 +012-008+0003007R08 +000+0'.
003900     05  FILLER PIC X(30) VALUE '01+0001008R09 -012+000+0000000'.
004000     05  FILLER PIC X(30) VALUE 'R10 +005-003+0007006R11 +000-0'.
004100     05  FILLER PIC X(30) VALUE '01+0002001R12 +999-099-0999012'.
004200 01  TAB REDEFINES TABV.
004300     05  T OCCURS 12 TIMES.
004400         10  T-TAG  PIC X(4).
004500         10  T-ZS   PIC X.
004600         10  T-ZD   PIC 999.
004700         10  T-PS   PIC X.
004800         10  T-PD   PIC 999.
004900         10  T-BS   PIC X.
005000         10  T-BI   PIC 9999.
005100         10  T-UZ   PIC 999.
005200 01  D-ZD  PIC -999.
005300 01  D-PD  PIC -999.
005400 01  D-BI  PIC -9999.
005500 01  CNT   PIC 99 VALUE 0.
005600 PROCEDURE DIVISION.
005700 MAIN-PARA.
005800     SORT SORT-FILE DESCENDING KEY S-ZD
005900                    ASCENDING KEY S-PD S-BI
006000                    DESCENDING KEY S-UZ
006100         INPUT PROCEDURE IS LOAD-IT
006200         OUTPUT PROCEDURE IS SHOW-IT.
006300     DISPLAY 'RETURNED ' CNT.
006400     STOP RUN.
006500 LOAD-IT SECTION.
006600 L1.
006700     PERFORM LOAD-ONE VARYING I FROM 1 BY 1 UNTIL I > 12.
006800     GO TO L-EXIT.
006900 LOAD-ONE.
007000     MOVE T-TAG (I) TO W-TAG.
007100     MOVE T-ZD (I) TO W-ZD.
007200     IF T-ZS (I) = '-' COMPUTE W-ZD = 0 - W-ZD.
007300     MOVE T-PD (I) TO W-PD.
007400     IF T-PS (I) = '-' COMPUTE W-PD = 0 - W-PD.
007500     MOVE T-BI (I) TO W-BI.
007600     IF T-BS (I) = '-' COMPUTE W-BI = 0 - W-BI.
007700     MOVE T-UZ (I) TO W-UZ.
007800     IF I < 7 RELEASE S-REC FROM W-REC
007900     ELSE MOVE W-REC TO S-REC RELEASE S-REC.
008000 L-EXIT.
008100     EXIT.
008200 SHOW-IT SECTION.
008300 S1.
008400     RETURN SORT-FILE INTO W-REC AT END GO TO S-EXIT.
008500     ADD 1 TO CNT.
008600     MOVE W-ZD TO D-ZD. MOVE W-PD TO D-PD. MOVE W-BI TO D-BI.
008700     DISPLAY W-TAG ' ' D-ZD ' ' D-PD ' ' D-BI ' ' W-UZ.
008800     GO TO S1.
008900 S-EXIT.
009000     EXIT.
