000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SUB12.
000300* A subprogram with twelve parameters: CALL ... USING was capped
000400* at eight arguments, PROCEDURE DIVISION USING at sixteen (#39).
000500 DATA DIVISION.
000600 LINKAGE SECTION.
000700 01  P1  PIC 99.
000800 01  P2  PIC 99.
000900 01  P3  PIC 99.
001000 01  P4  PIC 99.
001100 01  P5  PIC 99.
001200 01  P6  PIC 99.
001300 01  P7  PIC 99.
001400 01  P8  PIC 99.
001500 01  P9  PIC 99.
001600 01  P10 PIC 99.
001700 01  P11 PIC 99.
001800 01  P12 PIC 99.
001900 PROCEDURE DIVISION USING P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P11 P12.
002000 MAIN-PARA.
002100     COMPUTE P12 = P1 + P2 + P3 + P4 + P5 + P6 + P7 + P8
002200                 + P9 + P10 + P11.
002300     GOBACK.
