000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SUB2DIF.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  TAB.
000600     05  ROW OCCURS 2.
000700         10  COL OCCURS 2 PIC X VALUE 'A'.
000800 PROCEDURE DIVISION.
000900     IF COL (1 2) = 'A' DISPLAY 'Y'.
001000     STOP RUN.
