000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. USE77.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  WS PIC X VALUE 'A'.
000600 LINKAGE SECTION.
000700 77  LS-X PIC X.
000800 PROCEDURE DIVISION USING LS-X.
000900     GOBACK.
